zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135fxx_ca7.h
/***************  Bit definition for DCMIPP_P0CSCSZR register  ****************/
#define DCMIPP_P0CSCSZR_HSIZE_Pos         (0U)
#define DCMIPP_P0CSCSZR_HSIZE_Msk         (0xFFFUL << DCMIPP_P0CSCSZR_HSIZE_Pos)         /*!< 0x00000FFF */
#define DCMIPP_P0CSCSZR_HSIZE             DCMIPP_P0CSCSZR_HSIZE_Msk                     /*!< current horizontal size, from 0 to 4094 word wide (data 32-bit). If the value is maintained at 0 when enabling the crop thanks to the ENABLE bit, the value is forced internally at 0x3FF which is the maximum value. */
#define DCMIPP_P0CSCSZR_HSIZE_0           (0x1UL << DCMIPP_P0CSCSZR_HSIZE_Pos)           /*!< 0x00000001 */
#define DCMIPP_P0CSCSZR_HSIZE_1           (0x2UL << DCMIPP_P0CSCSZR_HSIZE_Pos)           /*!< 0x00000002 */
#define DCMIPP_P0CSCSZR_HSIZE_2           (0x4UL << DCMIPP_P0CSCSZR_HSIZE_Pos)           /*!< 0x00000004 */
#define DCMIPP_P0CSCSZR_HSIZE_3           (0x8UL << DCMIPP_P0CSCSZR_HSIZE_Pos)           /*!< 0x00000008 */
#define DCMIPP_P0CSCSZR_HSIZE_4           (0x10UL << DCMIPP_P0CSCSZR_HSIZE_Pos)          /*!< 0x00000010 */
#define DCMIPP_P0CSCSZR_HSIZE_5           (0x20UL << DCMIPP_P0CSCSZR_HSIZE_Pos)          /*!< 0x00000020 */
#define DCMIPP_P0CSCSZR_HSIZE_6           (0x40UL << DCMIPP_P0CSCSZR_HSIZE_Pos)          /*!< 0x00000040 */
#define DCMIPP_P0CSCSZR_HSIZE_7           (0x80UL << DCMIPP_P0CSCSZR_HSIZE_Pos)          /*!< 0x00000080 */
#define DCMIPP_P0CSCSZR_HSIZE_8           (0x100UL << DCMIPP_P0CSCSZR_HSIZE_Pos)         /*!< 0x00000100 */
#define DCMIPP_P0CSCSZR_HSIZE_9           (0x200UL << DCMIPP_P0CSCSZR_HSIZE_Pos)         /*!< 0x00000200 */
#define DCMIPP_P0CSCSZR_HSIZE_10          (0x400UL << DCMIPP_P0CSCSZR_HSIZE_Pos)         /*!< 0x00000400 */
#define DCMIPP_P0CSCSZR_HSIZE_11          (0x800UL << DCMIPP_P0CSCSZR_HSIZE_Pos)         /*!< 0x00000800 */
#define DCMIPP_P0CSCSZR_VSIZE_Pos         (16U)
#define DCMIPP_P0CSCSZR_VSIZE_Msk         (0xFFFUL << DCMIPP_P0CSCSZR_VSIZE_Pos)         /*!< 0x0FFF0000 */
#define DCMIPP_P0CSCSZR_VSIZE             DCMIPP_P0CSCSZR_VSIZE_Msk                     /*!< current vertical size, from 0 to 4094 pixels high.If the value is maintained at 0 when enabling the crop thanks to the ENABLE bit, the value is forced internally at 0x3FF which is the maximum value. */
#define DCMIPP_P0CSCSZR_VSIZE_0           (0x1UL << DCMIPP_P0CSCSZR_VSIZE_Pos)       /*!< 0x00010000 */
#define DCMIPP_P0CSCSZR_VSIZE_1           (0x2UL << DCMIPP_P0CSCSZR_VSIZE_Pos)       /*!< 0x00020000 */
#define DCMIPP_P0CSCSZR_VSIZE_2           (0x4UL << DCMIPP_P0CSCSZR_VSIZE_Pos)       /*!< 0x00040000 */
#define DCMIPP_P0CSCSZR_VSIZE_3           (0x8UL << DCMIPP_P0CSCSZR_VSIZE_Pos)       /*!< 0x00080000 */
#define DCMIPP_P0CSCSZR_VSIZE_4           (0x10UL << DCMIPP_P0CSCSZR_VSIZE_Pos)      /*!< 0x00100000 */
#define DCMIPP_P0CSCSZR_VSIZE_5           (0x20UL << DCMIPP_P0CSCSZR_VSIZE_Pos)      /*!< 0x00200000 */
#define DCMIPP_P0CSCSZR_VSIZE_6           (0x40UL << DCMIPP_P0CSCSZR_VSIZE_Pos)      /*!< 0x00400000 */
#define DCMIPP_P0CSCSZR_VSIZE_7           (0x80UL << DCMIPP_P0CSCSZR_VSIZE_Pos)      /*!< 0x00800000 */
#define DCMIPP_P0CSCSZR_VSIZE_8           (0x100UL << DCMIPP_P0CSCSZR_VSIZE_Pos)     /*!< 0x01000000 */
#define DCMIPP_P0CSCSZR_VSIZE_9           (0x200UL << DCMIPP_P0CSCSZR_VSIZE_Pos)     /*!< 0x02000000 */
#define DCMIPP_P0CSCSZR_VSIZE_10          (0x400UL << DCMIPP_P0CSCSZR_VSIZE_Pos)     /*!< 0x04000000 */
#define DCMIPP_P0CSCSZR_VSIZE_11          (0x800UL << DCMIPP_P0CSCSZR_VSIZE_Pos)     /*!< 0x08000000 */
#define DCMIPP_P0CSCSZR_POSNEG_Pos        (30U)
#define DCMIPP_P0CSCSZR_POSNEG_Msk        (0x1UL << DCMIPP_P0CSCSZR_POSNEG_Pos)          /*!< 0x40000000 */
#define DCMIPP_P0CSCSZR_POSNEG            DCMIPP_P0CSCSZR_POSNEG_Msk                    /*!< This bit has a meaning only if ENABLE bit is set. */
#define DCMIPP_P0CSCSZR_ENABLE_Pos        (31U)
#define DCMIPP_P0CSCSZR_ENABLE_Msk        (0x1UL << DCMIPP_P0CSCSZR_ENABLE_Pos)          /*!< 0x80000000 */
#define DCMIPP_P0CSCSZR_ENABLE            DCMIPP_P0CSCSZR_ENABLE_Msk                    /*!< It is the current value of the ENABLE bit. */

/****************  Bit definition for DCMIPP_P0CPPCR register  ****************/
#define DCMIPP_P0CPPCR_PAD_Pos            (5U)
#define DCMIPP_P0CPPCR_PAD_Msk            (0x1UL << DCMIPP_P0CPPCR_PAD_Pos)              /*!< 0x00000020 */
#define DCMIPP_P0CPPCR_PAD                DCMIPP_P0CPPCR_PAD_Msk                        /*!< Current Pad mode for Monochrome and RawBayer 10/12/14bpp: Msb vs Lsb alignment. */
#define DCMIPP_P0CPPCR_BSM_Pos            (7U)
#define DCMIPP_P0CPPCR_BSM_Msk            (0x3UL << DCMIPP_P0CPPCR_BSM_Pos)              /*!< 0x00000180 */
#define DCMIPP_P0CPPCR_BSM                DCMIPP_P0CPPCR_BSM_Msk                        /*!< Current Byte Select mode */
#define DCMIPP_P0CPPCR_BSM_0              (0x1UL << DCMIPP_P0CPPCR_BSM_Pos)             /*!< 0x00000080 */
#define DCMIPP_P0CPPCR_BSM_1              (0x2UL << DCMIPP_P0CPPCR_BSM_Pos)            /*!< 0x00000100 */
#define DCMIPP_P0CPPCR_OEBS_Pos           (9U)
#define DCMIPP_P0CPPCR_OEBS_Msk           (0x1UL << DCMIPP_P0CPPCR_OEBS_Pos)             /*!< 0x00000200 */
#define DCMIPP_P0CPPCR_OEBS               DCMIPP_P0CPPCR_OEBS_Msk                       /*!< Current Odd/Even Byte Select (Byte Select Start) */
#define DCMIPP_P0CPPCR_LSM_Pos            (10U)
#define DCMIPP_P0CPPCR_LSM_Msk            (0x1UL << DCMIPP_P0CPPCR_LSM_Pos)              /*!< 0x00000400 */
#define DCMIPP_P0CPPCR_LSM                DCMIPP_P0CPPCR_LSM_Msk                        /*!< Current Line Select mode */
#define DCMIPP_P0CPPCR_OELS_Pos           (11U)
#define DCMIPP_P0CPPCR_OELS_Msk           (0x1UL << DCMIPP_P0CPPCR_OELS_Pos)             /*!< 0x00000800 */
#define DCMIPP_P0CPPCR_OELS               DCMIPP_P0CPPCR_OELS_Msk                       /*!< Current Odd/Even Line Select (Line Select Start) */
#define DCMIPP_P0CPPCR_LINEMULT_Pos       (13U)
#define DCMIPP_P0CPPCR_LINEMULT_Msk       (0x7UL << DCMIPP_P0CPPCR_LINEMULT_Pos)         /*!< 0x0000E000 */
#define DCMIPP_P0CPPCR_LINEMULT           DCMIPP_P0CPPCR_LINEMULT_Msk                   /*!< current amount of capture completed lines for LINE Event and Interrupt */
#define DCMIPP_P0CPPCR_LINEMULT_0         (0x1UL << DCMIPP_P0CPPCR_LINEMULT_Pos)      /*!< 0x00002000 */
#define DCMIPP_P0CPPCR_LINEMULT_1         (0x2UL << DCMIPP_P0CPPCR_LINEMULT_Pos)      /*!< 0x00004000 */
#define DCMIPP_P0CPPCR_LINEMULT_2         (0x4UL << DCMIPP_P0CPPCR_LINEMULT_Pos)      /*!< 0x00008000 */
#define DCMIPP_P0CPPCR_DBM_Pos            (16U)
#define DCMIPP_P0CPPCR_DBM_Msk            (0x1UL << DCMIPP_P0CPPCR_DBM_Pos)              /*!< 0x00010000 */
#define DCMIPP_P0CPPCR_DBM                DCMIPP_P0CPPCR_DBM_Msk                        /*!< Double buffer mode */

/**************  Bit definition for DCMIPP_P0CPPM0AR1 register  ***************/
#define DCMIPP_P0CPPM0AR1_M0A_Pos         (0U)
#define DCMIPP_P0CPPM0AR1_M0A_Msk         (0xFFFFFFFFUL << DCMIPP_P0CPPM0AR1_M0A_Pos)    /*!< 0xFFFFFFFF */
#define DCMIPP_P0CPPM0AR1_M0A             DCMIPP_P0CPPM0AR1_M0A_Msk                     /*!< memory 0 address */
#define DCMIPP_P0CPPM0AR1_M0A_0           (0x1UL << DCMIPP_P0CPPM0AR1_M0A_Pos)           /*!< 0x00000001 */
#define DCMIPP_P0CPPM0AR1_M0A_1           (0x2UL << DCMIPP_P0CPPM0AR1_M0A_Pos)           /*!< 0x00000002 */
#define DCMIPP_P0CPPM0AR1_M0A_2           (0x4UL << DCMIPP_P0CPPM0AR1_M0A_Pos)           /*!< 0x00000004 */
#define DCMIPP_P0CPPM0AR1_M0A_3           (0x8UL << DCMIPP_P0CPPM0AR1_M0A_Pos)           /*!< 0x00000008 */
#define DCMIPP_P0CPPM0AR1_M0A_4           (0x10UL << DCMIPP_P0CPPM0AR1_M0A_Pos)          /*!< 0x00000010 */
#define DCMIPP_P0CPPM0AR1_M0A_5           (0x20UL << DCMIPP_P0CPPM0AR1_M0A_Pos)          /*!< 0x00000020 */
#define DCMIPP_P0CPPM0AR1_M0A_6           (0x40UL << DCMIPP_P0CPPM0AR1_M0A_Pos)          /*!< 0x00000040 */
#define DCMIPP_P0CPPM0AR1_M0A_7           (0x80UL << DCMIPP_P0CPPM0AR1_M0A_Pos)          /*!< 0x00000080 */
#define DCMIPP_P0CPPM0AR1_M0A_8           (0x100UL << DCMIPP_P0CPPM0AR1_M0A_Pos)         /*!< 0x00000100 */
#define DCMIPP_P0CPPM0AR1_M0A_9           (0x200UL << DCMIPP_P0CPPM0AR1_M0A_Pos)         /*!< 0x00000200 */
#define DCMIPP_P0CPPM0AR1_M0A_10          (0x400UL << DCMIPP_P0CPPM0AR1_M0A_Pos)         /*!< 0x00000400 */
#define DCMIPP_P0CPPM0AR1_M0A_11          (0x800UL << DCMIPP_P0CPPM0AR1_M0A_Pos)         /*!< 0x00000800 */
#define DCMIPP_P0CPPM0AR1_M0A_12          (0x1000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)        /*!< 0x00001000 */
#define DCMIPP_P0CPPM0AR1_M0A_13          (0x2000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)        /*!< 0x00002000 */
#define DCMIPP_P0CPPM0AR1_M0A_14          (0x4000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)        /*!< 0x00004000 */
#define DCMIPP_P0CPPM0AR1_M0A_15          (0x8000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)        /*!< 0x00008000 */
#define DCMIPP_P0CPPM0AR1_M0A_16          (0x10000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)       /*!< 0x00010000 */
#define DCMIPP_P0CPPM0AR1_M0A_17          (0x20000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)       /*!< 0x00020000 */
#define DCMIPP_P0CPPM0AR1_M0A_18          (0x40000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)       /*!< 0x00040000 */
#define DCMIPP_P0CPPM0AR1_M0A_19          (0x80000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)       /*!< 0x00080000 */
#define DCMIPP_P0CPPM0AR1_M0A_20          (0x100000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)      /*!< 0x00100000 */
#define DCMIPP_P0CPPM0AR1_M0A_21          (0x200000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)      /*!< 0x00200000 */
#define DCMIPP_P0CPPM0AR1_M0A_22          (0x400000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)      /*!< 0x00400000 */
#define DCMIPP_P0CPPM0AR1_M0A_23          (0x800000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)      /*!< 0x00800000 */
#define DCMIPP_P0CPPM0AR1_M0A_24          (0x1000000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)     /*!< 0x01000000 */
#define DCMIPP_P0CPPM0AR1_M0A_25          (0x2000000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)     /*!< 0x02000000 */
#define DCMIPP_P0CPPM0AR1_M0A_26          (0x4000000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)     /*!< 0x04000000 */
#define DCMIPP_P0CPPM0AR1_M0A_27          (0x8000000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)     /*!< 0x08000000 */
#define DCMIPP_P0CPPM0AR1_M0A_28          (0x10000000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)    /*!< 0x10000000 */
#define DCMIPP_P0CPPM0AR1_M0A_29          (0x20000000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)    /*!< 0x20000000 */
#define DCMIPP_P0CPPM0AR1_M0A_30          (0x40000000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)    /*!< 0x40000000 */
#define DCMIPP_P0CPPM0AR1_M0A_31          (0x80000000UL << DCMIPP_P0CPPM0AR1_M0A_Pos)    /*!< 0x80000000 */

/**************  Bit definition for DCMIPP_P0CPPM0AR2 register  ***************/
#define DCMIPP_P0CPPM0AR2_M0A_Pos         (0U)
#define DCMIPP_P0CPPM0AR2_M0A_Msk         (0xFFFFFFFFUL << DCMIPP_P0CPPM0AR2_M0A_Pos)    /*!< 0xFFFFFFFF */
#define DCMIPP_P0CPPM0AR2_M0A             DCMIPP_P0CPPM0AR2_M0A_Msk                     /*!< memory 0 address */
#define DCMIPP_P0CPPM0AR2_M0A_0           (0x1UL << DCMIPP_P0CPPM0AR2_M0A_Pos)           /*!< 0x00000001 */
#define DCMIPP_P0CPPM0AR2_M0A_1           (0x2UL << DCMIPP_P0CPPM0AR2_M0A_Pos)           /*!< 0x00000002 */
#define DCMIPP_P0CPPM0AR2_M0A_2           (0x4UL << DCMIPP_P0CPPM0AR2_M0A_Pos)           /*!< 0x00000004 */
#define DCMIPP_P0CPPM0AR2_M0A_3           (0x8UL << DCMIPP_P0CPPM0AR2_M0A_Pos)           /*!< 0x00000008 */
#define DCMIPP_P0CPPM0AR2_M0A_4           (0x10UL << DCMIPP_P0CPPM0AR2_M0A_Pos)          /*!< 0x00000010 */
#define DCMIPP_P0CPPM0AR2_M0A_5           (0x20UL << DCMIPP_P0CPPM0AR2_M0A_Pos)          /*!< 0x00000020 */
#define DCMIPP_P0CPPM0AR2_M0A_6           (0x40UL << DCMIPP_P0CPPM0AR2_M0A_Pos)          /*!< 0x00000040 */
#define DCMIPP_P0CPPM0AR2_M0A_7           (0x80UL << DCMIPP_P0CPPM0AR2_M0A_Pos)          /*!< 0x00000080 */
#define DCMIPP_P0CPPM0AR2_M0A_8           (0x100UL << DCMIPP_P0CPPM0AR2_M0A_Pos)         /*!< 0x00000100 */
#define DCMIPP_P0CPPM0AR2_M0A_9           (0x200UL << DCMIPP_P0CPPM0AR2_M0A_Pos)         /*!< 0x00000200 */
#define DCMIPP_P0CPPM0AR2_M0A_10          (0x400UL << DCMIPP_P0CPPM0AR2_M0A_Pos)         /*!< 0x00000400 */
#define DCMIPP_P0CPPM0AR2_M0A_11          (0x800UL << DCMIPP_P0CPPM0AR2_M0A_Pos)         /*!< 0x00000800 */
#define DCMIPP_P0CPPM0AR2_M0A_12          (0x1000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)        /*!< 0x00001000 */
#define DCMIPP_P0CPPM0AR2_M0A_13          (0x2000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)        /*!< 0x00002000 */
#define DCMIPP_P0CPPM0AR2_M0A_14          (0x4000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)        /*!< 0x00004000 */
#define DCMIPP_P0CPPM0AR2_M0A_15          (0x8000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)        /*!< 0x00008000 */
#define DCMIPP_P0CPPM0AR2_M0A_16          (0x10000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)       /*!< 0x00010000 */
#define DCMIPP_P0CPPM0AR2_M0A_17          (0x20000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)       /*!< 0x00020000 */
#define DCMIPP_P0CPPM0AR2_M0A_18          (0x40000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)       /*!< 0x00040000 */
#define DCMIPP_P0CPPM0AR2_M0A_19          (0x80000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)       /*!< 0x00080000 */
#define DCMIPP_P0CPPM0AR2_M0A_20          (0x100000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)      /*!< 0x00100000 */
#define DCMIPP_P0CPPM0AR2_M0A_21          (0x200000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)      /*!< 0x00200000 */
#define DCMIPP_P0CPPM0AR2_M0A_22          (0x400000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)      /*!< 0x00400000 */
#define DCMIPP_P0CPPM0AR2_M0A_23          (0x800000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)      /*!< 0x00800000 */
#define DCMIPP_P0CPPM0AR2_M0A_24          (0x1000000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)     /*!< 0x01000000 */
#define DCMIPP_P0CPPM0AR2_M0A_25          (0x2000000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)     /*!< 0x02000000 */
#define DCMIPP_P0CPPM0AR2_M0A_26          (0x4000000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)     /*!< 0x04000000 */
#define DCMIPP_P0CPPM0AR2_M0A_27          (0x8000000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)     /*!< 0x08000000 */
#define DCMIPP_P0CPPM0AR2_M0A_28          (0x10000000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)    /*!< 0x10000000 */
#define DCMIPP_P0CPPM0AR2_M0A_29          (0x20000000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)    /*!< 0x20000000 */
#define DCMIPP_P0CPPM0AR2_M0A_30          (0x40000000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)    /*!< 0x40000000 */
#define DCMIPP_P0CPPM0AR2_M0A_31          (0x80000000UL << DCMIPP_P0CPPM0AR2_M0A_Pos)    /*!< 0x80000000 */

/****************  Bit definition for DCMIPP_HWCFGR register  *****************/

/*****************  Bit definition for DCMIPP_VERR register  ******************/
#define DCMIPP_VERR_MINREV_Pos            (0U)
#define DCMIPP_VERR_MINREV_Msk            (0xFUL << DCMIPP_VERR_MINREV_Pos)              /*!< 0x0000000F */
#define DCMIPP_VERR_MINREV                DCMIPP_VERR_MINREV_Msk                        /*!< Minor Revision of the IP */
#define DCMIPP_VERR_MINREV_0              (0x1UL << DCMIPP_VERR_MINREV_Pos)              /*!< 0x00000001 */
#define DCMIPP_VERR_MINREV_1              (0x2UL << DCMIPP_VERR_MINREV_Pos)              /*!< 0x00000002 */
#define DCMIPP_VERR_MINREV_2              (0x4UL << DCMIPP_VERR_MINREV_Pos)              /*!< 0x00000004 */
#define DCMIPP_VERR_MINREV_3              (0x8UL << DCMIPP_VERR_MINREV_Pos)              /*!< 0x00000008 */
#define DCMIPP_VERR_MAJREV_Pos            (4U)
#define DCMIPP_VERR_MAJREV_Msk            (0xFUL << DCMIPP_VERR_MAJREV_Pos)              /*!< 0x000000F0 */
#define DCMIPP_VERR_MAJREV                DCMIPP_VERR_MAJREV_Msk                        /*!< Major Revision of the IP */
#define DCMIPP_VERR_MAJREV_0              (0x1UL << DCMIPP_VERR_MAJREV_Pos)             /*!< 0x00000010 */
#define DCMIPP_VERR_MAJREV_1              (0x2UL << DCMIPP_VERR_MAJREV_Pos)             /*!< 0x00000020 */
#define DCMIPP_VERR_MAJREV_2              (0x4UL << DCMIPP_VERR_MAJREV_Pos)             /*!< 0x00000040 */
#define DCMIPP_VERR_MAJREV_3              (0x8UL << DCMIPP_VERR_MAJREV_Pos)             /*!< 0x00000080 */

