zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135fxx_ca7.h
/**
  * @brief SAES hardware accelerator
  */
typedef struct
{
  __IO uint32_t CR;          /*!< SAES control register,                        Address offset: 0x00 */
  __IO uint32_t SR;          /*!< SAES status register,                         Address offset: 0x04 */
  __IO uint32_t DINR;        /*!< SAES data input register,                     Address offset: 0x08 */
  __IO uint32_t DOUTR;       /*!< SAES data output register,                    Address offset: 0x0C */
  __IO uint32_t KEYR0;       /*!< SAES key register 0,                          Address offset: 0x10 */
  __IO uint32_t KEYR1;       /*!< SAES key register 1,                          Address offset: 0x14 */
  __IO uint32_t KEYR2;       /*!< SAES key register 2,                          Address offset: 0x18 */
  __IO uint32_t KEYR3;       /*!< SAES key register 3,                          Address offset: 0x1C */
  __IO uint32_t IVR0;        /*!< SAES initialization vector register 0,        Address offset: 0x20 */
  __IO uint32_t IVR1;        /*!< SAES initialization vector register 1,        Address offset: 0x24 */
  __IO uint32_t IVR2;        /*!< SAES initialization vector register 2,        Address offset: 0x28 */
  __IO uint32_t IVR3;        /*!< SAES initialization vector register 3,        Address offset: 0x2C */
  __IO uint32_t KEYR4;       /*!< SAES key register 4,                          Address offset: 0x30 */
  __IO uint32_t KEYR5;       /*!< SAES key register 5,                          Address offset: 0x34 */
  __IO uint32_t KEYR6;       /*!< SAES key register 6,                          Address offset: 0x38 */
  __IO uint32_t KEYR7;       /*!< SAES key register 7,                          Address offset: 0x3C */
  __IO uint32_t SUSP0R;      /*!< SAES suspend registers 0,                     Address offset: 0x40 */
  __IO uint32_t SUSP1R;      /*!< SAES suspend registers 1,                     Address offset: 0x44 */
  __IO uint32_t SUSP2R;      /*!< SAES suspend registers 2,                     Address offset: 0x48 */
  __IO uint32_t SUSP3R;      /*!< SAES suspend registers 3,                     Address offset: 0x4c */
  __IO uint32_t SUSP4R;      /*!< SAES suspend registers 4,                     Address offset: 0x50 */
  __IO uint32_t SUSP5R;      /*!< SAES suspend registers 5,                     Address offset: 0x54 */
  __IO uint32_t SUSP6R;      /*!< SAES suspend registers 6,                     Address offset: 0x58 */
  __IO uint32_t SUSP7R;      /*!< SAES suspend registers 7,                     Address offset: 0x5c */
  uint32_t RESERVED1[40];    /*!< Reserved,                                     Address offset: 0x60 -- 0xFC */
  __IO uint32_t DPACFGR;     /*!< SAES IP DPACFGR register,                     Address offset: 0x0100 */
  uint32_t RESERVED2[127];   /*!< Reserved,                                     Address offset: 0x104 -- 0x2FC */
  __IO uint32_t IER;         /*!< SAES Interrupt Enable Register,               Address offset: 0x0300 */
  __IO uint32_t ISR;         /*!< SAES Interrupt Status Register,               Address offset: 0x0304 */
  __IO uint32_t ICR;         /*!< SAES Interrupt Clear Register,                Address offset: 0x0308 */
  uint32_t RESERVED3[57];   /*!< Reserved,                                      Address offset: 0x30C -- 0x3EC */
  __IO uint32_t HWCFGR;      /*!< SAES HW Configuration Register,               Address offset: 0x3F0 */
  __IO uint32_t VERR;        /*!< SAES Version Register,                        Address offset: 0x3F4 */
  __IO uint32_t IPIDR;       /*!< SAES Identification Register,                 Address offset: 0x3F8 */
  __IO uint32_t SIDR;        /*!< SAES Size ID Register,                        Address offset: 0x3FC */
} SAES_TypeDef;

 
 /**
  * @brief Public Key Accelerator (PKA)
  */
#define PKA_RAM_SIZE (5336U/4U)
typedef struct
{
  __IO uint32_t CR;          /*!< PKA control register,                 Address offset: 0x00 */
  __IO uint32_t SR;          /*!< PKA status register,                  Address offset: 0x04 */
  __IO uint32_t CLRFR;       /*!< PKA clear flag register,              Address offset: 0x08 */
  uint32_t  Reserved1[253];  /*!< Reserved                              Address offset: 0x000C-0x03FC*/
  __IO uint32_t RAM[PKA_RAM_SIZE];   /*!< PKA RAM,                      Address offset: 0x0400-0xXXXX */
  uint32_t  Reserved2[1788-PKA_RAM_SIZE];  /*!< Reserved                Address offset: (0xXXXX+4)-0x1FEF*/
  __IO uint32_t HWCFGR;      /*!< PKA configuration register,           Address offset: 0x1FF0 */
  __IO uint32_t VERR;        /*!< PKA version register,                 Address offset: 0x1FF4 */
  __IO uint32_t ID;          /*!< PKA ID register,                      Address offset: 0x1FF8 */
} PKA_TypeDef;

/**
  * @brief MCE Memory Cipher Engine
  */
typedef struct
{
  __IO uint32_t CR;                        /*!< MCE Configuration Register,               Address offset: 0x000 */
  __IO uint32_t SR;                        /*!< MCE Status Register,                      Address offset: 0x004 */
  __IO uint32_t IASR;                      /*!< MCE Illegal Access Status Register,       Address offset: 0x008 */
  __IO uint32_t IACR;                      /*!< MCE Illegal Access Clear Register,        Address offset: 0x00C */
  __IO uint32_t IAIER;                     /*!< MCE Illegal Interrupt Enable Register,    Address offset: 0x010 */
  uint32_t RESERVED0[2];                   /*! Reserved                                   Address offset: 0x014 - 0x018 */
  __IO uint32_t PRIVCFGR;                  /*!< MCE Privileged Configuration Register,    Address offset: 0x01C */
  uint32_t RESERVED1[8];                   /*! Reserved                                   Address offset: 0x020 - 0x03C */
  __IO uint32_t REGCR;                     /*!< MCE Region X Configuration Register,      Address offset: 0x040 */
  __IO uint32_t SADDR;                     /*!< MCE Start Address For Region X Register,  Address offset: 0x044 */
  __IO uint32_t EADDR;                     /*!< MCE End Address For Region X Register,    Address offset: 0x048 */
  uint32_t RESERVED2[109];                 /*! Reserved                                   Address offset: 0x04C - 0x1FC */
  __IO uint32_t MKEYR0;                    /*!< MCE Master Key 0 Register,                Address offset: 0x200 */
  __IO uint32_t MKEYR1;                    /*!< MCE Master Key 1 Register,                Address offset: 0x204 */
  __IO uint32_t MKEYR2;                    /*!< MCE Master Key 2 Register,                Address offset: 0x208 */
  __IO uint32_t MKEYR3;                    /*!< MCE Master Key 3 Register,                Address offset: 0x20C */
  uint32_t RESERVED3[118];                 /*! Reserved                                   Address offset: 0x210 - 0x3E4 */
  __IO uint32_t HWCFGR3;                   /*!< MCE Version Register,                     Address offset: 0x3E8 */
  __IO uint32_t HWCFGR2;                   /*!< MCE Version Register,                     Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;                   /*!< MCE Version Register,                     Address offset: 0x3F0 */
  __IO uint32_t VERR;                      /*!< MCE Version Register,                     Address offset: 0x3F4 */
  __IO uint32_t IPIDR;                     /*!< MCE Identification Register,              Address offset: 0x3F8 */
  __IO uint32_t SIDR;                      /*!< MCE Size ID Register,                     Address offset: 0x3FC */
} MCE_TypeDef;

/**
  * @brief USBPHYC  USB HS PHY Control
  */
typedef struct
{
  __IO uint32_t PLL;             /*!< USBPHYC PLL control register   Address offset: 0x000 */
       uint32_t RESERVED0;       /*!< Reserved                       Address offset: 0x004 */
  __IO uint32_t MISC;            /*!< USBPHYC misc control register  Address offset: 0x008 */
       uint32_t RESERVED1[64];   /*!< Reserved                       Address offset: 0x00C-0x108 */
  __IO uint32_t TUNE1;           /*!< USBPHYC PHY 1 TUNE register    Address offset: 0x10C */
       uint32_t RESERVED2[63];   /*!< Reserved                       Address offset: 0x110-0x208 */
  __IO uint32_t TUNE2;           /*!< USBPHYC PHY 2 TUNE register    Address offset: 0x20C */
       uint32_t RESERVED3[891];  /*!< Reserved                       Address offset: 0x210-0xFF8 */
  __IO uint32_t VERR;            /*!< USBPHYC VERSION register       Address offset: 0xFFC */
} USBPHYC_GlobalTypeDef;


/**
  * @brief TZC TrustZone Address Space Controller for DDR
  */
typedef struct
{
  __IO uint32_t BUILD_CONFIG;       /*!< Build config register,               Address offset: 0x00 */
  __IO uint32_t ACTION;             /*!< Action register,                     Address offset: 0x04 */
  __IO uint32_t GATE_KEEPER;        /*!< Gate keeper register,                Address offset: 0x08 */
  __IO uint32_t SPECULATION_CTRL;   /*!< Speculation control register,        Address offset: 0x0C */
  uint8_t RESERVED0[0x100 - 0x10];
  __IO uint32_t REG_BASE_LOWO;      /*!< Region 0 base address low register,  Address offset: 0x100 */
  __IO uint32_t REG_BASE_HIGHO;     /*!< Region 0 base address high register, Address offset: 0x104 */
  __IO uint32_t REG_TOP_LOWO;       /*!< Region 0 top address low register,   Address offset: 0x108 */
  __IO uint32_t REG_TOP_HIGHO;      /*!< Region 0 top address high register,  Address offset: 0x10C */
  __IO uint32_t REG_ATTRIBUTESO;    /*!< Region 0 attribute register,         Address offset: 0x110 */
  __IO uint32_t REG_ID_ACCESSO;     /*!< Region 0 ID access register,         Address offset: 0x114 */
} TZC_TypeDef;



/**
  * @brief ETZPC Extended TrustZone Protection Controller
  */
typedef struct
{
  __IO uint32_t   TZMA0_SIZE;         /*!<ETZPC ROM Secure Size Definition register,             Address offset: 0x00 */
  __IO uint32_t   TZMA1_SIZE;         /*!<ETZPC SYSRAM Secure Size Definition register,          Address offset: 0x04 */
  uint32_t        RESERVED0[2];       /*!< Reserved */
  __IO uint32_t   DECPROT0;           /*!<ETZPC Securable peripheral definition register 0,      Address offset: 0x10 */
  __IO uint32_t   DECPROT1;           /*!<ETZPC Securable peripheral definition register 1,      Address offset: 0x14 */
  __IO uint32_t   DECPROT2;           /*!<ETZPC Securable peripheral definition register 2,      Address offset: 0x18 */
  __IO uint32_t   DECPROT3;           /*!<ETZPC Securable peripheral definition register 3,      Address offset: 0x1C */
  __IO uint32_t   DECPROT4;           /*!<ETZPC Securable peripheral definition register 4,      Address offset: 0x20 */
  __IO uint32_t   DECPROT5;           /*!<ETZPC Securable peripheral definition register 5,      Address offset: 0x24 */
  uint32_t        RESERVED1[2];       /*!< Reserved */
  __IO uint32_t   DECPROT_LOCK0;      /*!<ETZPC Securable lock of security register 0,           Address offset: 0x30 */
  __IO uint32_t   DECPROT_LOCK1;      /*!<ETZPC Securable lock of security register 1,           Address offset: 0x34 */
  __IO uint32_t   DECPROT_LOCK2;      /*!<ETZPC Securable lock of security register 2,           Address offset: 0x38 */
  uint32_t        RESERVED2[237];     /*!< Reserved */
  __IO uint32_t   HWCFGR;             /*!< ETZPC IP HW configuration register                    Address offset:0x3F0  */
  __IO uint32_t   IP_VER;             /*!< ETZPC IP version register                             Address offset:0x3F4  */
  __IO uint32_t   ID;                 /*!< ETZPC IP version register                             Address offset:0x3F8  */
  __IO uint32_t   SID;                /*!< ETZPC IP version register                             Address offset:0x3FC  */
} ETZPC_TypeDef;



/**
  * @brief STGENC System Generic Counter Control
  */
typedef struct
{
  __IO uint32_t CNTCR;          /*!< STGENC Counter Control Register,              Address offset: 0x000 */
       uint32_t CNTSR;          /*!< STGENC Counter Status Register,               Address offset: 0x004 */
  __IO uint32_t CNTCVL;         /*!< STGENC Current Counter Value Lower Register,  Address offset: 0x008 */
  __IO uint32_t CNTCVU;         /*!< STGENC Current Counter Value Upper Register,  Address offset: 0x00C */
       uint32_t RESERVED1[4];                         /*!< Reserved, Address offsets: 0x010-0x01C */
  __IO uint32_t CNTFID0;        /*!< STGENC Base Frequency ID Register,            Address offset: 0x020 */
       uint32_t RESERVED2[1003];                      /*!< Reserved, Address offsets: 0x024-0xFCC */
  __IO uint32_t PIDR4;          /*!< STGENC Peripheral ID4 Register,               Address offset: 0xFD0 */
  __IO uint32_t RESERVED3[3];                         /*!< Reserved, Address offsets: 0xFD4-0xFDC */
  __IO uint32_t PIDR[4];        /*!< STGENC Peripheral ID0-ID3 Registers,          Address offset: 0xFE0 */
  __IO uint32_t CIDR[4];        /*!< STGENC Component ID0-ID3 Registers,           Address offset: 0xFF0 */
} STGENC_TypeDef;

/**
  * @brief STGENR System Timestamp Generator Read
  */
typedef struct
{
  __IO uint32_t CNTCVL;  /*!< STGENR Current Counter Value Lower Register,  Address offset: 0x000 */
  __IO uint32_t CNTCVU;  /*!< STGENR Current Counter Value Upper Register,  Address offset: 0x004 */
       uint32_t RESERVED1[1010];                      /*!< Reserved, Address offsets: 0x008-0xFCC */
  __IO uint32_t PIDR4;   /*!< STGENR Peripheral ID4 Register,               Address offset: 0xFD0 */
  __IO uint32_t RESERVED2[3];                         /*!< Reserved, Address offsets: 0xFD4-0xFDC */
  __IO uint32_t PIDR[4]; /*!< STGENR Peripheral ID0-ID3 Registers,          Address offset: 0xFE0 */
  __IO uint32_t CIDR[4]; /*!< STGENR Component ID0-ID3 Registers,           Address offset: 0xFF0 */
} STGENR_TypeDef;


/**
  * @brief Firewall
  */

typedef struct
{
  __IO uint32_t CSSA;     /*!< Code Segment Start Address register,              Address offset: 0x00 */
  __IO uint32_t CSL;      /*!< Code Segment Length register,                      Address offset: 0x04 */
  __IO uint32_t NVDSSA;   /*!< NON volatile data Segment Start Address register,  Address offset: 0x08 */
  __IO uint32_t NVDSL;    /*!< NON volatile data Segment Length register,         Address offset: 0x0C */
  __IO uint32_t VDSSA ;   /*!< Volatile data Segment Start Address register,      Address offset: 0x10 */
  __IO uint32_t VDSL ;    /*!< Volatile data Segment Length register,             Address offset: 0x14 */
  __IO uint32_t CR ;      /*!< Configuration  register,                           Address offset: 0x20 */

} FIREWALL_TypeDef;

/**
  * @brief Power Control
  */

typedef struct
{
  __IO uint32_t CR1;              /*!< PWR control register 1,                   Address offset: 0x00 */
  __IO uint32_t CSR1;             /*!< PWR control status register 1,            Address offset: 0x04 */
  __IO uint32_t CR2;              /*!< PWR control register 2,                   Address offset: 0x08 */
  __IO uint32_t CR3;              /*!< PWR control register 3,                   Address offset: 0x0C */
  __IO uint32_t MPUCR;            /*!< PWR MPU control register,                 Address offset: 0x10 */
       uint32_t RESERVED0[3];     /*!< Reserved, 0x14-0x1C                       Address offset: 0x14 */
  __IO uint32_t WKUPCR;           /*!< PWR wakeup clear register,                Address offset: 0x20 */
  __IO uint32_t WKUPFR;           /*!< PWR wakeup flag register,                 Address offset: 0x24 */
  __IO uint32_t MPUWKUPENR;       /*!< PWR wakeup enable and polarity register,  Address offset: 0x28 */
       uint32_t RESERVED1[242];   /*!< Reserved, 0x2C-0x3F0                      Address offset: 0x2C */
  __IO uint32_t VER;              /*!< PWR IP version register,                  Address offset: 0x3F4 */
  __IO uint32_t ID;               /*!< PWR IP identification register,           Address offset: 0x3F8 */
  __IO uint32_t SID;              /*!< PWR size ID register,                     Address offset: 0x3FC */
} PWR_TypeDef;


/**
  * @brief Reset and Clock Control
  */

