zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135fxx_ca7.h
/******************  Bit definition for ADC_TR2 register  ******************/
#define ADC_TR2_LT2_Pos                   (0U)
#define ADC_TR2_LT2_Msk                   (0xFFUL << ADC_TR2_LT2_Pos)           /*!< 0x000000FF */
#define ADC_TR2_LT2                       ADC_TR2_LT2_Msk                      /*!< Analog watchdog 2 lower threshold */
#define ADC_TR2_LT2_0                     (0x1UL << ADC_TR2_LT2_Pos)            /*!< 0x00000001 */
#define ADC_TR2_LT2_1                     (0x2UL << ADC_TR2_LT2_Pos)            /*!< 0x00000002 */
#define ADC_TR2_LT2_2                     (0x4UL << ADC_TR2_LT2_Pos)            /*!< 0x00000004 */
#define ADC_TR2_LT2_3                     (0x8UL << ADC_TR2_LT2_Pos)            /*!< 0x00000008 */
#define ADC_TR2_LT2_4                     (0x10UL << ADC_TR2_LT2_Pos)           /*!< 0x00000010 */
#define ADC_TR2_LT2_5                     (0x20UL << ADC_TR2_LT2_Pos)           /*!< 0x00000020 */
#define ADC_TR2_LT2_6                     (0x40UL << ADC_TR2_LT2_Pos)           /*!< 0x00000040 */
#define ADC_TR2_LT2_7                     (0x80UL << ADC_TR2_LT2_Pos)           /*!< 0x00000080 */

#define ADC_TR2_HT2_Pos                   (16U)
#define ADC_TR2_HT2_Msk                   (0xFFUL << ADC_TR2_HT2_Pos)           /*!< 0x00FF0000 */
#define ADC_TR2_HT2                       ADC_TR2_HT2_Msk                      /*!< Analog watchdog 2 higher threshold */
#define ADC_TR2_HT2_0                     (0x1UL << ADC_TR2_HT2_Pos)            /*!< 0x00010000 */
#define ADC_TR2_HT2_1                     (0x2UL << ADC_TR2_HT2_Pos)            /*!< 0x00020000 */
#define ADC_TR2_HT2_2                     (0x4UL << ADC_TR2_HT2_Pos)            /*!< 0x00040000 */
#define ADC_TR2_HT2_3                     (0x8UL << ADC_TR2_HT2_Pos)            /*!< 0x00080000 */
#define ADC_TR2_HT2_4                     (0x10UL << ADC_TR2_HT2_Pos)           /*!< 0x00100000 */
#define ADC_TR2_HT2_5                     (0x20UL << ADC_TR2_HT2_Pos)           /*!< 0x00200000 */
#define ADC_TR2_HT2_6                     (0x40UL << ADC_TR2_HT2_Pos)           /*!< 0x00400000 */
#define ADC_TR2_HT2_7                     (0x80UL << ADC_TR2_HT2_Pos)           /*!< 0x00800000 */

/******************  Bit definition for ADC_TR3 register  ******************/
#define ADC_TR3_LT3_Pos                   (0U)
#define ADC_TR3_LT3_Msk                   (0xFFUL << ADC_TR3_LT3_Pos)           /*!< 0x000000FF */
#define ADC_TR3_LT3                       ADC_TR3_LT3_Msk                      /*!< Analog watchdog 3 lower threshold */
#define ADC_TR3_LT3_0                     (0x1UL << ADC_TR3_LT3_Pos)            /*!< 0x00000001 */
#define ADC_TR3_LT3_1                     (0x2UL << ADC_TR3_LT3_Pos)            /*!< 0x00000002 */
#define ADC_TR3_LT3_2                     (0x4UL << ADC_TR3_LT3_Pos)            /*!< 0x00000004 */
#define ADC_TR3_LT3_3                     (0x8UL << ADC_TR3_LT3_Pos)            /*!< 0x00000008 */
#define ADC_TR3_LT3_4                     (0x10UL << ADC_TR3_LT3_Pos)           /*!< 0x00000010 */
#define ADC_TR3_LT3_5                     (0x20UL << ADC_TR3_LT3_Pos)           /*!< 0x00000020 */
#define ADC_TR3_LT3_6                     (0x40UL << ADC_TR3_LT3_Pos)           /*!< 0x00000040 */
#define ADC_TR3_LT3_7                     (0x80UL << ADC_TR3_LT3_Pos)           /*!< 0x00000080 */

#define ADC_TR3_HT3_Pos                   (16U)
#define ADC_TR3_HT3_Msk                   (0xFFUL << ADC_TR3_HT3_Pos)           /*!< 0x00FF0000 */
#define ADC_TR3_HT3                       ADC_TR3_HT3_Msk                      /*!< Analog watchdog 3 higher threshold */
#define ADC_TR3_HT3_0                     (0x1UL << ADC_TR3_HT3_Pos)            /*!< 0x00010000 */
#define ADC_TR3_HT3_1                     (0x2UL << ADC_TR3_HT3_Pos)            /*!< 0x00020000 */
#define ADC_TR3_HT3_2                     (0x4UL << ADC_TR3_HT3_Pos)            /*!< 0x00040000 */
#define ADC_TR3_HT3_3                     (0x8UL << ADC_TR3_HT3_Pos)            /*!< 0x00080000 */
#define ADC_TR3_HT3_4                     (0x10UL << ADC_TR3_HT3_Pos)           /*!< 0x00100000 */
#define ADC_TR3_HT3_5                     (0x20UL << ADC_TR3_HT3_Pos)           /*!< 0x00200000 */
#define ADC_TR3_HT3_6                     (0x40UL << ADC_TR3_HT3_Pos)           /*!< 0x00400000 */
#define ADC_TR3_HT3_7                     (0x80UL << ADC_TR3_HT3_Pos)           /*!< 0x00800000 */

/********************  Bit definition for ADC_SQR1 register  ********************/
#define ADC_SQR1_L_Pos                    (0U)
#define ADC_SQR1_L_Msk                    (0xFUL << ADC_SQR1_L_Pos)             /*!< 0x0000000F */
#define ADC_SQR1_L                        ADC_SQR1_L_Msk                       /*!< ADC regular channel sequence length */
#define ADC_SQR1_L_0                      (0x1UL << ADC_SQR1_L_Pos)             /*!< 0x00000001 */
#define ADC_SQR1_L_1                      (0x2UL << ADC_SQR1_L_Pos)             /*!< 0x00000002 */
#define ADC_SQR1_L_2                      (0x4UL << ADC_SQR1_L_Pos)             /*!< 0x00000004 */
#define ADC_SQR1_L_3                      (0x8UL << ADC_SQR1_L_Pos)             /*!< 0x00000008 */

#define ADC_SQR1_SQ1_Pos                  (6U)
#define ADC_SQR1_SQ1_Msk                  (0x1FUL << ADC_SQR1_SQ1_Pos)          /*!< 0x000007C0 */
#define ADC_SQR1_SQ1                      ADC_SQR1_SQ1_Msk                     /*!< ADC 1st conversion in regular sequence */
#define ADC_SQR1_SQ1_0                    (0x01UL << ADC_SQR1_SQ1_Pos)          /*!< 0x00000040 */
#define ADC_SQR1_SQ1_1                    (0x02UL << ADC_SQR1_SQ1_Pos)          /*!< 0x00000080 */
#define ADC_SQR1_SQ1_2                    (0x04UL << ADC_SQR1_SQ1_Pos)          /*!< 0x00000100 */
#define ADC_SQR1_SQ1_3                    (0x08UL << ADC_SQR1_SQ1_Pos)          /*!< 0x00000200 */
#define ADC_SQR1_SQ1_4                    (0x10UL << ADC_SQR1_SQ1_Pos)          /*!< 0x00000400 */

#define ADC_SQR1_SQ2_Pos                  (12U)
#define ADC_SQR1_SQ2_Msk                  (0x1FUL << ADC_SQR1_SQ2_Pos)          /*!< 0x0001F000 */
#define ADC_SQR1_SQ2                      ADC_SQR1_SQ2_Msk                     /*!< ADC 2nd conversion in regular sequence */
#define ADC_SQR1_SQ2_0                    (0x01UL << ADC_SQR1_SQ2_Pos)          /*!< 0x00001000 */
#define ADC_SQR1_SQ2_1                    (0x02UL << ADC_SQR1_SQ2_Pos)          /*!< 0x00002000 */
#define ADC_SQR1_SQ2_2                    (0x04UL << ADC_SQR1_SQ2_Pos)          /*!< 0x00004000 */
#define ADC_SQR1_SQ2_3                    (0x08UL << ADC_SQR1_SQ2_Pos)          /*!< 0x00008000 */
#define ADC_SQR1_SQ2_4                    (0x10UL << ADC_SQR1_SQ2_Pos)          /*!< 0x00010000 */

#define ADC_SQR1_SQ3_Pos                  (18U)
#define ADC_SQR1_SQ3_Msk                  (0x1FUL << ADC_SQR1_SQ3_Pos)          /*!< 0x007C0000 */
#define ADC_SQR1_SQ3                      ADC_SQR1_SQ3_Msk                     /*!< ADC 3rd conversion in regular sequence */
#define ADC_SQR1_SQ3_0                    (0x01UL << ADC_SQR1_SQ3_Pos)          /*!< 0x00040000 */
#define ADC_SQR1_SQ3_1                    (0x02UL << ADC_SQR1_SQ3_Pos)          /*!< 0x00080000 */
#define ADC_SQR1_SQ3_2                    (0x04UL << ADC_SQR1_SQ3_Pos)          /*!< 0x00100000 */
#define ADC_SQR1_SQ3_3                    (0x08UL << ADC_SQR1_SQ3_Pos)          /*!< 0x00200000 */
#define ADC_SQR1_SQ3_4                    (0x10UL << ADC_SQR1_SQ3_Pos)          /*!< 0x00400000 */

