zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135fxx_ca7.h
/*****************  Bit definition for DDRPERFM_VER register  *****************/
#define DDRPERFM_VER_MINREV_Pos (0U)
#define DDRPERFM_VER_MINREV_Msk (0xFUL << DDRPERFM_VER_MINREV_Pos) /*!< 0x0000000F */
#define DDRPERFM_VER_MINREV     DDRPERFM_VER_MINREV_Msk           /*!< Minor revision number. */
#define DDRPERFM_VER_MINREV_0   (0x1UL << DDRPERFM_VER_MINREV_Pos) /*!< 0x00000001 */
#define DDRPERFM_VER_MINREV_1   (0x2UL << DDRPERFM_VER_MINREV_Pos) /*!< 0x00000002 */
#define DDRPERFM_VER_MINREV_2   (0x4UL << DDRPERFM_VER_MINREV_Pos) /*!< 0x00000004 */
#define DDRPERFM_VER_MINREV_3   (0x8UL << DDRPERFM_VER_MINREV_Pos) /*!< 0x00000008 */
#define DDRPERFM_VER_MAJREV_Pos (4U)
#define DDRPERFM_VER_MAJREV_Msk (0xFUL << DDRPERFM_VER_MAJREV_Pos) /*!< 0x000000F0 */
#define DDRPERFM_VER_MAJREV     DDRPERFM_VER_MAJREV_Msk           /*!< Major revision number. */
#define DDRPERFM_VER_MAJREV_0   (0x1UL << DDRPERFM_VER_MAJREV_Pos) /*!< 0x00000010 */
#define DDRPERFM_VER_MAJREV_1   (0x2UL << DDRPERFM_VER_MAJREV_Pos) /*!< 0x00000020 */
#define DDRPERFM_VER_MAJREV_2   (0x4UL << DDRPERFM_VER_MAJREV_Pos) /*!< 0x00000040 */
#define DDRPERFM_VER_MAJREV_3   (0x8UL << DDRPERFM_VER_MAJREV_Pos) /*!< 0x00000080 */

/*****************  Bit definition for DDRPERFM_ID register  ******************/
#define DDRPERFM_ID_ID_Pos (0U)
#define DDRPERFM_ID_ID_Msk (0xFFFFFFFFUL << DDRPERFM_ID_ID_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_ID_ID     DDRPERFM_ID_ID_Msk                  /*!< DDRPERFM unique identification. */
#define DDRPERFM_ID_ID_0   (0x1UL << DDRPERFM_ID_ID_Pos)        /*!< 0x00000001 */
#define DDRPERFM_ID_ID_1   (0x2UL << DDRPERFM_ID_ID_Pos)        /*!< 0x00000002 */
#define DDRPERFM_ID_ID_2   (0x4UL << DDRPERFM_ID_ID_Pos)        /*!< 0x00000004 */
#define DDRPERFM_ID_ID_3   (0x8UL << DDRPERFM_ID_ID_Pos)        /*!< 0x00000008 */
#define DDRPERFM_ID_ID_4   (0x10UL << DDRPERFM_ID_ID_Pos)       /*!< 0x00000010 */
#define DDRPERFM_ID_ID_5   (0x20UL << DDRPERFM_ID_ID_Pos)       /*!< 0x00000020 */
#define DDRPERFM_ID_ID_6   (0x40UL << DDRPERFM_ID_ID_Pos)       /*!< 0x00000040 */
#define DDRPERFM_ID_ID_7   (0x80UL << DDRPERFM_ID_ID_Pos)       /*!< 0x00000080 */
#define DDRPERFM_ID_ID_8   (0x100UL << DDRPERFM_ID_ID_Pos)      /*!< 0x00000100 */
#define DDRPERFM_ID_ID_9   (0x200UL << DDRPERFM_ID_ID_Pos)      /*!< 0x00000200 */
#define DDRPERFM_ID_ID_10  (0x400UL << DDRPERFM_ID_ID_Pos)      /*!< 0x00000400 */
#define DDRPERFM_ID_ID_11  (0x800UL << DDRPERFM_ID_ID_Pos)      /*!< 0x00000800 */
#define DDRPERFM_ID_ID_12  (0x1000UL << DDRPERFM_ID_ID_Pos)     /*!< 0x00001000 */
#define DDRPERFM_ID_ID_13  (0x2000UL << DDRPERFM_ID_ID_Pos)     /*!< 0x00002000 */
#define DDRPERFM_ID_ID_14  (0x4000UL << DDRPERFM_ID_ID_Pos)     /*!< 0x00004000 */
#define DDRPERFM_ID_ID_15  (0x8000UL << DDRPERFM_ID_ID_Pos)     /*!< 0x00008000 */
#define DDRPERFM_ID_ID_16  (0x10000UL << DDRPERFM_ID_ID_Pos)    /*!< 0x00010000 */
#define DDRPERFM_ID_ID_17  (0x20000UL << DDRPERFM_ID_ID_Pos)    /*!< 0x00020000 */
#define DDRPERFM_ID_ID_18  (0x40000UL << DDRPERFM_ID_ID_Pos)    /*!< 0x00040000 */
#define DDRPERFM_ID_ID_19  (0x80000UL << DDRPERFM_ID_ID_Pos)    /*!< 0x00080000 */
#define DDRPERFM_ID_ID_20  (0x100000UL << DDRPERFM_ID_ID_Pos)   /*!< 0x00100000 */
#define DDRPERFM_ID_ID_21  (0x200000UL << DDRPERFM_ID_ID_Pos)   /*!< 0x00200000 */
#define DDRPERFM_ID_ID_22  (0x400000UL << DDRPERFM_ID_ID_Pos)   /*!< 0x00400000 */
#define DDRPERFM_ID_ID_23  (0x800000UL << DDRPERFM_ID_ID_Pos)   /*!< 0x00800000 */
#define DDRPERFM_ID_ID_24  (0x1000000UL << DDRPERFM_ID_ID_Pos)  /*!< 0x01000000 */
#define DDRPERFM_ID_ID_25  (0x2000000UL << DDRPERFM_ID_ID_Pos)  /*!< 0x02000000 */
#define DDRPERFM_ID_ID_26  (0x4000000UL << DDRPERFM_ID_ID_Pos)  /*!< 0x04000000 */
#define DDRPERFM_ID_ID_27  (0x8000000UL << DDRPERFM_ID_ID_Pos)  /*!< 0x08000000 */
#define DDRPERFM_ID_ID_28  (0x10000000UL << DDRPERFM_ID_ID_Pos) /*!< 0x10000000 */
#define DDRPERFM_ID_ID_29  (0x20000000UL << DDRPERFM_ID_ID_Pos) /*!< 0x20000000 */
#define DDRPERFM_ID_ID_30  (0x40000000UL << DDRPERFM_ID_ID_Pos) /*!< 0x40000000 */
#define DDRPERFM_ID_ID_31  (0x80000000UL << DDRPERFM_ID_ID_Pos) /*!< 0x80000000 */

/*****************  Bit definition for DDRPERFM_SID register  *****************/
#define DDRPERFM_SID_SID_Pos (0U)
#define DDRPERFM_SID_SID_Msk (0xFFFFFFFFUL << DDRPERFM_SID_SID_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_SID_SID     DDRPERFM_SID_SID_Msk                  /*!< magic ID for automatic IP discovery. */
#define DDRPERFM_SID_SID_0   (0x1UL << DDRPERFM_SID_SID_Pos)        /*!< 0x00000001 */
#define DDRPERFM_SID_SID_1   (0x2UL << DDRPERFM_SID_SID_Pos)        /*!< 0x00000002 */
#define DDRPERFM_SID_SID_2   (0x4UL << DDRPERFM_SID_SID_Pos)        /*!< 0x00000004 */
#define DDRPERFM_SID_SID_3   (0x8UL << DDRPERFM_SID_SID_Pos)        /*!< 0x00000008 */
#define DDRPERFM_SID_SID_4   (0x10UL << DDRPERFM_SID_SID_Pos)       /*!< 0x00000010 */
#define DDRPERFM_SID_SID_5   (0x20UL << DDRPERFM_SID_SID_Pos)       /*!< 0x00000020 */
#define DDRPERFM_SID_SID_6   (0x40UL << DDRPERFM_SID_SID_Pos)       /*!< 0x00000040 */
#define DDRPERFM_SID_SID_7   (0x80UL << DDRPERFM_SID_SID_Pos)       /*!< 0x00000080 */
#define DDRPERFM_SID_SID_8   (0x100UL << DDRPERFM_SID_SID_Pos)      /*!< 0x00000100 */
#define DDRPERFM_SID_SID_9   (0x200UL << DDRPERFM_SID_SID_Pos)      /*!< 0x00000200 */
#define DDRPERFM_SID_SID_10  (0x400UL << DDRPERFM_SID_SID_Pos)      /*!< 0x00000400 */
#define DDRPERFM_SID_SID_11  (0x800UL << DDRPERFM_SID_SID_Pos)      /*!< 0x00000800 */
#define DDRPERFM_SID_SID_12  (0x1000UL << DDRPERFM_SID_SID_Pos)     /*!< 0x00001000 */
#define DDRPERFM_SID_SID_13  (0x2000UL << DDRPERFM_SID_SID_Pos)     /*!< 0x00002000 */
#define DDRPERFM_SID_SID_14  (0x4000UL << DDRPERFM_SID_SID_Pos)     /*!< 0x00004000 */
#define DDRPERFM_SID_SID_15  (0x8000UL << DDRPERFM_SID_SID_Pos)     /*!< 0x00008000 */
#define DDRPERFM_SID_SID_16  (0x10000UL << DDRPERFM_SID_SID_Pos)    /*!< 0x00010000 */
#define DDRPERFM_SID_SID_17  (0x20000UL << DDRPERFM_SID_SID_Pos)    /*!< 0x00020000 */
#define DDRPERFM_SID_SID_18  (0x40000UL << DDRPERFM_SID_SID_Pos)    /*!< 0x00040000 */
#define DDRPERFM_SID_SID_19  (0x80000UL << DDRPERFM_SID_SID_Pos)    /*!< 0x00080000 */
#define DDRPERFM_SID_SID_20  (0x100000UL << DDRPERFM_SID_SID_Pos)   /*!< 0x00100000 */
#define DDRPERFM_SID_SID_21  (0x200000UL << DDRPERFM_SID_SID_Pos)   /*!< 0x00200000 */
#define DDRPERFM_SID_SID_22  (0x400000UL << DDRPERFM_SID_SID_Pos)   /*!< 0x00400000 */
#define DDRPERFM_SID_SID_23  (0x800000UL << DDRPERFM_SID_SID_Pos)   /*!< 0x00800000 */
#define DDRPERFM_SID_SID_24  (0x1000000UL << DDRPERFM_SID_SID_Pos)  /*!< 0x01000000 */
#define DDRPERFM_SID_SID_25  (0x2000000UL << DDRPERFM_SID_SID_Pos)  /*!< 0x02000000 */
#define DDRPERFM_SID_SID_26  (0x4000000UL << DDRPERFM_SID_SID_Pos)  /*!< 0x04000000 */
#define DDRPERFM_SID_SID_27  (0x8000000UL << DDRPERFM_SID_SID_Pos)  /*!< 0x08000000 */
#define DDRPERFM_SID_SID_28  (0x10000000UL << DDRPERFM_SID_SID_Pos) /*!< 0x10000000 */
#define DDRPERFM_SID_SID_29  (0x20000000UL << DDRPERFM_SID_SID_Pos) /*!< 0x20000000 */
#define DDRPERFM_SID_SID_30  (0x40000000UL << DDRPERFM_SID_SID_Pos) /*!< 0x40000000 */
#define DDRPERFM_SID_SID_31  (0x80000000UL << DDRPERFM_SID_SID_Pos) /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                    DDRPHYC block description (DDRPHYC)                     */
/*                                                                            */
/******************************************************************************/

