zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135fxx_ca7.h
/*******************  Bit definition for IWDG_KR register  ********************/
#define IWDG_WINR_WIN_Pos    (0U)
#define IWDG_WINR_WIN_Msk    (0xFFFUL << IWDG_WINR_WIN_Pos)                     /*!< 0x00000FFF */
#define IWDG_WINR_WIN        IWDG_WINR_WIN_Msk                                 /*!< Watchdog counter window value */

/*******************  Bit definition for IWDG_EWCR register  ********************/
#define IWDG_EWCR_EWIT_Pos   (0U)
#define IWDG_EWCR_EWIT_Msk   (0xFFFUL << IWDG_EWCR_EWIT_Pos)                     /*!< 0x00000FFF */
#define IWDG_EWCR_EWIT       IWDG_EWCR_EWIT_Msk                                 /*!< Watchdog early wakeup comparator value */
#define IWDG_EWCR_EWIC_Pos   (14U)
#define IWDG_EWCR_EWIC_Msk   (0x1UL << IWDG_EWCR_EWIC_Pos)                       /*!< 0x00004000 */
#define IWDG_EWCR_EWIC       IWDG_EWCR_EWIC_Msk                                 /*!< Watchdog early interrupt acknowledge */
#define IWDG_EWCR_EWIE_Pos   (15U)
#define IWDG_EWCR_EWIE_Msk   (0x1UL << IWDG_EWCR_EWIE_Pos)                       /*!< 0x00008000 */
#define IWDG_EWCR_EWIE       IWDG_EWCR_EWIE_Msk                                 /*!< Watchdog early interrupt enable */

/**********************  Bit definition for IWDG_HWCFGR register  ***************/
#define IWDG_HWCFGR_WINDOW_Pos      (0U)
#define IWDG_HWCFGR_WINDOW_Msk      (0xFUL << IWDG_HWCFGR_WINDOW_Pos)            /*!< 0x0000000F */
#define IWDG_HWCFGR_WINDOW          IWDG_HWCFGR_WINDOW_Msk                      /*!< Support of Window function */
#define IWDG_HWCFGR_PR_DEFAULT_Pos  (4U)
#define IWDG_HWCFGR_PR_DEFAULT_Msk  (0xFUL << IWDG_HWCFGR_PR_DEFAULT_Pos)        /*!< 0x000000F0 */
#define IWDG_HWCFGR_PR_DEFAULT      IWDG_HWCFGR_PR_DEFAULT_Msk                  /*!< Prescaler default value */

/**********************  Bit definition for IWDG_VERR register  *****************/
#define IWDG_VERR_MINREV_Pos      (0U)
#define IWDG_VERR_MINREV_Msk      (0xFUL << IWDG_VERR_MINREV_Pos)               /*!< 0x0000000F */
#define IWDG_VERR_MINREV          IWDG_VERR_MINREV_Msk                         /*!< Minor Revision number */
#define IWDG_VERR_MAJREV_Pos      (4U)
#define IWDG_VERR_MAJREV_Msk      (0xFUL << IWDG_VERR_MAJREV_Pos)               /*!< 0x000000F0 */
#define IWDG_VERR_MAJREV          IWDG_VERR_MAJREV_Msk                         /*!< Major Revision number */

/**********************  Bit definition for IWDG_IDR register  ****************/
#define IWDG_IDR_IPID_Pos       (0U)
#define IWDG_IDR_IPID_Msk       (0xFFFFFFFFUL << IWDG_IDR_IPID_Pos)         /*!< 0xFFFFFFFF */
#define IWDG_IDR_IPID           IWDG_IDR_IPID_Msk                          /*!< IP Identification */

/**********************  Bit definition for IWDG_SIDR register  *****************/
#define IWDG_SIDR_SID_Pos         (0U)
#define IWDG_SIDR_SID_Msk         (0xFFFFFFFFUL << IWDG_SIDR_SID_Pos)           /*!< 0xFFFFFFFF */
#define IWDG_SIDR_SID             IWDG_SIDR_SID_Msk                            /*!< IP size identification */

/******************************************************************************/
/*                                                                            */
/*                      LCD-TFT Display Controller (LTDC)                     */
/*                                                                            */
/******************************************************************************/

/* Bit fields for LTDC_IDR register */
#define LTDC_IDR_REV_Pos                 (0U)
#define LTDC_IDR_REV_Msk                 (0xffUL << LTDC_IDR_REV_Pos)
#define LTDC_IDR_REV                     LTDC_IDR_REV_Msk  /*!< revision */
#define LTDC_IDR_MINVER_Pos              (8U)
#define LTDC_IDR_MINVER_Msk              (0xffUL << LTDC_IDR_MINVER_Pos)
#define LTDC_IDR_MINVER                  LTDC_IDR_MINVER_Msk  /*!< minor version */
#define LTDC_IDR_MAJVER_Pos              (16U)
#define LTDC_IDR_MAJVER_Msk              (0xffUL << LTDC_IDR_MAJVER_Pos)
#define LTDC_IDR_MAJVER                  LTDC_IDR_MAJVER_Msk  /*!< major version */

/* Bit fields for LTDC_LCR register */
#define LTDC_LCR_LNBR_Pos                (0U)
#define LTDC_LCR_LNBR_Msk                (0xffUL << LTDC_LCR_LNBR_Pos)
#define LTDC_LCR_LNBR                    LTDC_LCR_LNBR_Msk  /*!< number of layers */

/* Bit fields for LTDC_SSCR register */
#define LTDC_SSCR_VSH_Pos                (0U)
#define LTDC_SSCR_VSH_Msk                (0xffffUL << LTDC_SSCR_VSH_Pos)
#define LTDC_SSCR_VSH                    LTDC_SSCR_VSH_Msk  /*!< vertical synchronization height (in units of horizontal scan line)These bits define the vertical Synchronization height minus 1. It represents the number of horizontal synchronization lines. */
#define LTDC_SSCR_HSW_Pos                (16U)
#define LTDC_SSCR_HSW_Msk                (0xffffUL << LTDC_SSCR_HSW_Pos)
#define LTDC_SSCR_HSW                    LTDC_SSCR_HSW_Msk  /*!< horizontal synchronization width (in units of pixel clock period)These bits define the number of Horizontal Synchronization pixel minus 1. */

/* Bit fields for LTDC_BPCR register */
#define LTDC_BPCR_AVBP_Pos               (0U)
#define LTDC_BPCR_AVBP_Msk               (0xffffUL << LTDC_BPCR_AVBP_Pos)
#define LTDC_BPCR_AVBP                   LTDC_BPCR_AVBP_Msk  /*!< accumulated Vertical back porch (in units of horizontal scan line)These bits define the accumulated vertical back porch width that includes the vertical synchronization and vertical back porch lines minus 1.The vertical back porch is the number of horizontal scan lines at a start of frame to the start of the first active scan line of the next frame. */
#define LTDC_BPCR_AHBP_Pos               (16U)
#define LTDC_BPCR_AHBP_Msk               (0xffffUL << LTDC_BPCR_AHBP_Pos)
#define LTDC_BPCR_AHBP                   LTDC_BPCR_AHBP_Msk  /*!< accumulated horizontal back porch (in units of pixel clock period)These bits define the accumulated horizontal back porch width that includes the horizontal synchronization and horizontal back porch pixels minus 1.The horizontal back porch is the period between horizontal synchronization going inactive and the start of the active display part of the next scan line. */

/* Bit fields for LTDC_AWCR register */
#define LTDC_AWCR_AAH_Pos                (0U)
#define LTDC_AWCR_AAH_Msk                (0xffffUL << LTDC_AWCR_AAH_Pos)
#define LTDC_AWCR_AAH                    LTDC_AWCR_AAH_Msk  /*!< accumulated active height (in units of horizontal scan line)These bits define the accumulated height which includes the vertical synchronization, vertical back porch and the active height lines minus 1. The active height is the number of active lines in the panel.Refer to device datasheet for maximum active height supported following maximum pixel clock. */
#define LTDC_AWCR_AAW_Pos                (16U)
#define LTDC_AWCR_AAW_Msk                (0xffffUL << LTDC_AWCR_AAW_Pos)
#define LTDC_AWCR_AAW                    LTDC_AWCR_AAW_Msk  /*!< accumulated active width (in units of pixel clock period)These bits define the accumulated active width which includes the horizontal synchronization, horizontal back porch and active pixels minus 1.The active width is the number of pixels in active display area of the panel scan line.Refer to device datasheet for maximum active width supported following maximum pixel clock. */

/* Bit fields for LTDC_TWCR register */
#define LTDC_TWCR_TOTALH_Pos             (0U)
#define LTDC_TWCR_TOTALH_Msk             (0xffffUL << LTDC_TWCR_TOTALH_Pos)
#define LTDC_TWCR_TOTALH                 LTDC_TWCR_TOTALH_Msk  /*!< total height (in units of horizontal scan line)These bits defines the accumulated height which includes the vertical synchronization, vertical back porch, the active height and vertical front porch height lines minus 1. */
#define LTDC_TWCR_TOTALW_Pos             (16U)
#define LTDC_TWCR_TOTALW_Msk             (0xffffUL << LTDC_TWCR_TOTALW_Pos)
#define LTDC_TWCR_TOTALW                 LTDC_TWCR_TOTALW_Msk  /*!< total width (in units of pixel clock period)These bits defines the accumulated total width which includes the horizontal synchronization, horizontal back porch, active width and horizontal front porch pixels minus 1. */

/* Bit fields for LTDC_GCR register */
#define LTDC_GCR_LTDCEN_Pos              (0U)
#define LTDC_GCR_LTDCEN_Msk              (0x1UL << LTDC_GCR_LTDCEN_Pos)
#define LTDC_GCR_LTDCEN                  LTDC_GCR_LTDCEN_Msk  /*!< LCD-TFT controller enableThis bit is set and cleared by software.- 0: LTDC disable- 1: LTDC enable */
#define LTDC_GCR_GAMEN_Pos               (1U)
#define LTDC_GCR_GAMEN_Msk               (0x1UL << LTDC_GCR_GAMEN_Pos)
#define LTDC_GCR_GAMEN                   LTDC_GCR_GAMEN_Msk  /*!< LCD-TFT controller enableThis bit is set and cleared by software.- 0: GammaCorrection disable (pixels bypass the gamma operator)- 1: Gamma Correction enable */
#define LTDC_GCR_ROTEN_Pos               (2U)
#define LTDC_GCR_ROTEN_Msk               (0x1UL << LTDC_GCR_ROTEN_Pos)
#define LTDC_GCR_ROTEN                   LTDC_GCR_ROTEN_Msk  /*!< LCD-TFT controller enableThis bit is set and cleared by software.- 0: Rotation disable- 1: Rotation enable (for a pure visual rotation, the mirroring has to be activated) */
#define LTDC_GCR_DBW_Pos                 (4U)
#define LTDC_GCR_DBW_Msk                 (0x7UL << LTDC_GCR_DBW_Pos)
#define LTDC_GCR_DBW                     LTDC_GCR_DBW_Msk  /*!< dither blue widthThese bits return the dither blue bits. */
#define LTDC_GCR_DGW_Pos                 (8U)
#define LTDC_GCR_DGW_Msk                 (0x7UL << LTDC_GCR_DGW_Pos)
#define LTDC_GCR_DGW                     LTDC_GCR_DGW_Msk  /*!< dither green widthThese bits return the dither green bits. */
#define LTDC_GCR_DRW_Pos                 (12U)
#define LTDC_GCR_DRW_Msk                 (0x7UL << LTDC_GCR_DRW_Pos)
#define LTDC_GCR_DRW                     LTDC_GCR_DRW_Msk  /*!< dither red widthThese bits return the Dither Red Bits. */
#define LTDC_GCR_DEN_Pos                 (16U)
#define LTDC_GCR_DEN_Msk                 (0x1UL << LTDC_GCR_DEN_Pos)
#define LTDC_GCR_DEN                     LTDC_GCR_DEN_Msk  /*!< dither enableThis bit is set and cleared by software.- 0: dither disable- 1: dither enable */
#define LTDC_GCR_BCKEN_Pos               (17U)
#define LTDC_GCR_BCKEN_Msk               (0x1UL << LTDC_GCR_BCKEN_Pos)
#define LTDC_GCR_BCKEN                   LTDC_GCR_BCKEN_Msk  /*!< backgroundlayer enableThis bit is set and cleared by software.- 0: backgrounddisable- 1: background enable */
#define LTDC_GCR_CRCEN_Pos               (19U)
#define LTDC_GCR_CRCEN_Msk               (0x1UL << LTDC_GCR_CRCEN_Pos)
#define LTDC_GCR_CRCEN                   LTDC_GCR_CRCEN_Msk  /*!< CRC enableThis bit is set and cleared by software.- 0: CRC disable- 1: CRC enable */
#define LTDC_GCR_SFEN_Pos                (24U)
#define LTDC_GCR_SFEN_Msk                (0x1UL << LTDC_GCR_SFEN_Pos)
#define LTDC_GCR_SFEN                    LTDC_GCR_SFEN_Msk  /*!< single-frame mode: mode enableThis bit is set and cleared by software.- 0: single-frame disable:a trigger (on SFSW or External) will generate a continuous flow.- 1: single-frame enable: a trigger (on SFSW or External) will generate a single frame. */
#define LTDC_GCR_SFSWTR_Pos              (25U)
#define LTDC_GCR_SFSWTR_Msk              (0x1UL << LTDC_GCR_SFSWTR_Pos)
#define LTDC_GCR_SFSWTR                  LTDC_GCR_SFSWTR_Msk  /*!< single-frame mode: software triggerThis bit is set by software and cleared by hardware.- 0: no action- 1: triggers one frame */
#define LTDC_GCR_SFEXEN_Pos              (26U)
#define LTDC_GCR_SFEXEN_Msk              (0x1UL << LTDC_GCR_SFEXEN_Pos)
#define LTDC_GCR_SFEXEN                  LTDC_GCR_SFEXEN_Msk  /*!< single-frame mode: external trigger enableThis bit is set and cleared by software.- 0: external trigger disable- 1: external trigger enable: a trigger on the external trigger will generate one single frame. */
#define LTDC_GCR_PCPOL_Pos               (28U)
#define LTDC_GCR_PCPOL_Msk               (0x1UL << LTDC_GCR_PCPOL_Pos)
#define LTDC_GCR_PCPOL                   LTDC_GCR_PCPOL_Msk  /*!< pixel clock polarityThis bit is set and cleared by software.- 0: pixel clock polarity is active low.- 1: pixel clock is active high. */
#define LTDC_GCR_DEPOL_Pos               (29U)
#define LTDC_GCR_DEPOL_Msk               (0x1UL << LTDC_GCR_DEPOL_Pos)
#define LTDC_GCR_DEPOL                   LTDC_GCR_DEPOL_Msk  /*!< blanking (=no data/pixel) polarityThis bit is set and cleared by software.- 0: blanking (no data/pixel) polarity is active low.- 1: blanking (no data/pixel) polarity is active high. */
#define LTDC_GCR_VSPOL_Pos               (30U)
#define LTDC_GCR_VSPOL_Msk               (0x1UL << LTDC_GCR_VSPOL_Pos)
#define LTDC_GCR_VSPOL                   LTDC_GCR_VSPOL_Msk  /*!< vertical synchronization polarityThis bit is set and cleared by software.- 0: vertical synchronization is active low.- 1: vertical synchronization is active high. */
#define LTDC_GCR_HSPOL_Pos               (31U)
#define LTDC_GCR_HSPOL_Msk               (0x1UL << LTDC_GCR_HSPOL_Pos)
#define LTDC_GCR_HSPOL                   LTDC_GCR_HSPOL_Msk  /*!< horizontal synchronization polarityThis bit is set and cleared by software.- 0: horizontal synchronization polarity is active low.- 1: horizontal synchronization polarity is active high. */

/* Bit fields for LTDC_GC1R register */
#define LTDC_GC1R_WBCH_Pos               (0U)
#define LTDC_GC1R_WBCH_Msk               (0xfUL << LTDC_GC1R_WBCH_Pos)
#define LTDC_GC1R_WBCH                   LTDC_GC1R_WBCH_Msk  /*!< width of blue channel output */
#define LTDC_GC1R_WGCH_Pos               (4U)
#define LTDC_GC1R_WGCH_Msk               (0xfUL << LTDC_GC1R_WGCH_Pos)
#define LTDC_GC1R_WGCH                   LTDC_GC1R_WGCH_Msk  /*!< width of green channel output */
#define LTDC_GC1R_WRCH_Pos               (8U)
#define LTDC_GC1R_WRCH_Msk               (0xfUL << LTDC_GC1R_WRCH_Pos)
#define LTDC_GC1R_WRCH                   LTDC_GC1R_WRCH_Msk  /*!< width of red channel output */
#define LTDC_GC1R_PRBA_Pos               (12U)
#define LTDC_GC1R_PRBA_Msk               (0x1UL << LTDC_GC1R_PRBA_Pos)
#define LTDC_GC1R_PRBA                   LTDC_GC1R_PRBA_Msk  /*!< precise blending ability */
#define LTDC_GC1R_DT_Pos                 (14U)
#define LTDC_GC1R_DT_Msk                 (0x3UL << LTDC_GC1R_DT_Pos)
#define LTDC_GC1R_DT                     LTDC_GC1R_DT_Msk  /*!< dithering technique implemented- 0: no dithering- 1: ordered 4x4 bayer- 2: ordered 4x4 custom- 3: pseudo-random LFSR */
#define LTDC_GC1R_GCT_Pos                (17U)
#define LTDC_GC1R_GCT_Msk                (0x7UL << LTDC_GC1R_GCT_Pos)
#define LTDC_GC1R_GCT                    LTDC_GC1R_GCT_Msk  /*!< gamma correction technique implemented- 0: no gamma- 1: gamma with 256 samples- 2: gamma with 8 interpolated segments3..7: reserved */
#define LTDC_GC1R_SHRA_Pos               (21U)
#define LTDC_GC1R_SHRA_Msk               (0x1UL << LTDC_GC1R_SHRA_Pos)
#define LTDC_GC1R_SHRA                   LTDC_GC1R_SHRA_Msk  /*!< shadow registers ability */
#define LTDC_GC1R_BCP_Pos                (22U)
#define LTDC_GC1R_BCP_Msk                (0x1UL << LTDC_GC1R_BCP_Pos)
#define LTDC_GC1R_BCP                    LTDC_GC1R_BCP_Msk  /*!< background color programmability (unique color blended as background) */
#define LTDC_GC1R_BBA_Pos                (23U)
#define LTDC_GC1R_BBA_Msk                (0x1UL << LTDC_GC1R_BBA_Pos)
#define LTDC_GC1R_BBA                    LTDC_GC1R_BBA_Msk  /*!< background blending ability */
#define LTDC_GC1R_LNIP_Pos               (24U)
#define LTDC_GC1R_LNIP_Msk               (0x1UL << LTDC_GC1R_LNIP_Pos)
#define LTDC_GC1R_LNIP                   LTDC_GC1R_LNIP_Msk  /*!< line-IRQ: line position programmability */
#define LTDC_GC1R_TP_Pos                 (25U)
#define LTDC_GC1R_TP_Msk                 (0x1UL << LTDC_GC1R_TP_Pos)
#define LTDC_GC1R_TP                     LTDC_GC1R_TP_Msk  /*!< timing programmability */
#define LTDC_GC1R_SPP_Pos                (27U)
#define LTDC_GC1R_SPP_Msk                (0x1UL << LTDC_GC1R_SPP_Pos)
#define LTDC_GC1R_SPP                    LTDC_GC1R_SPP_Msk  /*!< sync polarity programmability */
#define LTDC_GC1R_DWP_Pos                (28U)
#define LTDC_GC1R_DWP_Msk                (0x1UL << LTDC_GC1R_DWP_Pos)
#define LTDC_GC1R_DWP                    LTDC_GC1R_DWP_Msk  /*!< dither width programmability */
#define LTDC_GC1R_STRA_Pos               (29U)
#define LTDC_GC1R_STRA_Msk               (0x1UL << LTDC_GC1R_STRA_Pos)
#define LTDC_GC1R_STRA                   LTDC_GC1R_STRA_Msk  /*!< status register ability */
#define LTDC_GC1R_CRMA_Pos               (30U)
#define LTDC_GC1R_CRMA_Msk               (0x1UL << LTDC_GC1R_CRMA_Pos)
#define LTDC_GC1R_CRMA                   LTDC_GC1R_CRMA_Msk  /*!< configuration reading mode ability */
#define LTDC_GC1R_BMA_Pos                (31U)
#define LTDC_GC1R_BMA_Msk                (0x1UL << LTDC_GC1R_BMA_Pos)
#define LTDC_GC1R_BMA                    LTDC_GC1R_BMA_Msk  /*!< blind mode ability */

/* Bit fields for LTDC_GC2R register */
#define LTDC_GC2R_BLA_Pos                (0U)
#define LTDC_GC2R_BLA_Msk                (0x1UL << LTDC_GC2R_BLA_Pos)
#define LTDC_GC2R_BLA                    LTDC_GC2R_BLA_Msk  /*!< background layer ability (pixels of background layer would be read from memory) */
#define LTDC_GC2R_STSA_Pos               (1U)
#define LTDC_GC2R_STSA_Msk               (0x1UL << LTDC_GC2R_STSA_Pos)
#define LTDC_GC2R_STSA                   LTDC_GC2R_STSA_Msk  /*!< slave timings synchronization ability */
#define LTDC_GC2R_DVA_Pos                (2U)
#define LTDC_GC2R_DVA_Msk                (0x1UL << LTDC_GC2R_DVA_Pos)
#define LTDC_GC2R_DVA                    LTDC_GC2R_DVA_Msk  /*!< dual-view ability */
#define LTDC_GC2R_DPA_Pos                (3U)
#define LTDC_GC2R_DPA_Msk                (0x1UL << LTDC_GC2R_DPA_Pos)
#define LTDC_GC2R_DPA                    LTDC_GC2R_DPA_Msk  /*!< secondary RGB output port ability */
#define LTDC_GC2R_BW_Pos                 (4U)
#define LTDC_GC2R_BW_Msk                 (0x7UL << LTDC_GC2R_BW_Pos)
#define LTDC_GC2R_BW                     LTDC_GC2R_BW_Msk  /*!< bus width (log2 of number of bytes)- 2: 32bit bus- 3: 64bit bus- 4: 128bit bus */
#define LTDC_GC2R_EDCA_Pos               (7U)
#define LTDC_GC2R_EDCA_Msk               (0x1UL << LTDC_GC2R_EDCA_Pos)
#define LTDC_GC2R_EDCA                   LTDC_GC2R_EDCA_Msk  /*!< external display control ability */
#define LTDC_GC2R_OCA_Pos                (8U)
#define LTDC_GC2R_OCA_Msk                (0x1UL << LTDC_GC2R_OCA_Pos)
#define LTDC_GC2R_OCA                    LTDC_GC2R_OCA_Msk  /*!< output conversion ability (RGB to YCbCr) */
#define LTDC_GC2R_AXIIDA_Pos             (9U)
#define LTDC_GC2R_AXIIDA_Msk             (0x1UL << LTDC_GC2R_AXIIDA_Pos)
#define LTDC_GC2R_AXIIDA                 LTDC_GC2R_AXIIDA_Msk  /*!< AXIID ability */
#define LTDC_GC2R_ROTA_Pos               (10U)
#define LTDC_GC2R_ROTA_Msk               (0x1UL << LTDC_GC2R_ROTA_Pos)
#define LTDC_GC2R_ROTA                   LTDC_GC2R_ROTA_Msk  /*!< rotation support ability */
#define LTDC_GC2R_SISA_Pos               (11U)
#define LTDC_GC2R_SISA_Msk               (0x1UL << LTDC_GC2R_SISA_Pos)
#define LTDC_GC2R_SISA                   LTDC_GC2R_SISA_Msk  /*!< second interrupt set ability- 0: second interrupt set not available- 1: second interrupt set available */
#define LTDC_GC2R_SFA_Pos                (12U)
#define LTDC_GC2R_SFA_Msk                (0x1UL << LTDC_GC2R_SFA_Pos)
#define LTDC_GC2R_SFA                    LTDC_GC2R_SFA_Msk  /*!< single frame mode ability- 0: single frame not available.- 1: single frame available */
#define LTDC_GC2R_CRCA_Pos               (13U)
#define LTDC_GC2R_CRCA_Msk               (0x1UL << LTDC_GC2R_CRCA_Pos)
#define LTDC_GC2R_CRCA                   LTDC_GC2R_CRCA_Msk  /*!< CRC ability- 0: CRC no computation available- 1: CRC computation available */
#define LTDC_GC2R_BOA_Pos                (15U)
#define LTDC_GC2R_BOA_Msk                (0x1UL << LTDC_GC2R_BOA_Pos)
#define LTDC_GC2R_BOA                    LTDC_GC2R_BOA_Msk  /*!< blending order ability- 0: blending order fixed- 1: blending order configurable */

