zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135fxx_ca7.h
/********************  Bit definition for MCE_SADDR register  *****************/

#define MCE_SADDR_BADDSTART_Pos     (16U)
#define MCE_SADDR_BADDSTART_Msk     (0xFFFFUL << MCE_SADDR_BADDSTART_Pos)       /*!< 0xFFFF0000 */
#define MCE_SADDR_BADDSTART         MCE_SADDR_BADDSTART_Msk                    /*!< Region address start */

/********************  Bit definition for MCE_EADDR register  *****************/

#define MCE_EADDR_BADDEND_Pos       (16U)
#define MCE_EADDR_BADDEND_Msk       (0xFFFFUL << MCE_EADDR_BADDEND_Pos)         /*!< 0xFFFF0000 */
#define MCE_EADDR_BADDEND           MCE_EADDR_BADDEND_Msk                      /*!< Region address end */

/********************  Bit definition for MCE_MKEYR0 register  ****************/

#define MCE_MKEYR0_MKEY_Pos         (0U)
#define MCE_MKEYR0_MKEY_Msk         (0xFFFFFFFFUL << MCE_MKEYR0_MKEY_Pos)       /*!< 0xFFFFFFFF */
#define MCE_MKEYR0_MKEY             MCE_MKEYR0_MKEY_Msk                        /*!< Master key, bits [31:0] */

/********************  Bit definition for MCE_MKEYR1 register  ****************/

#define MCE_MKEYR1_MKEY_Pos         (0U)
#define MCE_MKEYR1_MKEY_Msk         (0xFFFFFFFFUL << MCE_MKEYR1_MKEY_Pos)       /*!< 0xFFFFFFFF */
#define MCE_MKEYR1_MKEY             MCE_MKEYR1_MKEY_Msk                        /*!< Master key, bits [63:32] */

/********************  Bit definition for MCE_MKEYR2 register  ****************/

#define MCE_MKEYR2_MKEY_Pos         (0U)
#define MCE_MKEYR2_MKEY_Msk         (0xFFFFFFFFUL << MCE_MKEYR2_MKEY_Pos)       /*!< 0xFFFFFFFF */
#define MCE_MKEYR2_MKEY             MCE_MKEYR2_MKEY_Msk                        /*!< Master key, bits [95:64] */

/********************  Bit definition for MCE_MKEYR3 register  ****************/

#define MCE_MKEYR3_MKEY_Pos         (0U)
#define MCE_MKEYR3_MKEY_Msk         (0xFFFFFFFFUL << MCE_MKEYR3_MKEY_Pos)       /*!< 0xFFFFFFFF */
#define MCE_MKEYR3_MKEY             MCE_MKEYR3_MKEY_Msk                        /*!< Master key, bits [127:96] */

/********************  Bit definition for MCE_HWCFGR3 register  ***************/

#define MCE_HWCFGR3_CFG1_Pos        (0U)
#define MCE_HWCFGR3_CFG1_Msk        (0xFUL << MCE_HWCFGR3_CFG1_Pos)             /*!< 0x0000000F */
#define MCE_HWCFGR3_CFG1            MCE_HWCFGR3_CFG1_Msk                       /*!< HW generic 1 */
#define MCE_HWCFGR3_CFG2_Pos        (4U)
#define MCE_HWCFGR3_CFG2_Msk        (0xFUL << MCE_HWCFGR3_CFG2_Pos)             /*!< 0x000000F0 */
#define MCE_HWCFGR3_CFG2            MCE_HWCFGR3_CFG2_Msk                       /*!< HW generic 2 */
#define MCE_HWCFGR3_CFG3_Pos        (8U)
#define MCE_HWCFGR3_CFG3_Msk        (0xFUL << MCE_HWCFGR3_CFG3_Pos)             /*!< 0x00000F00 */
#define MCE_HWCFGR3_CFG3            MCE_HWCFGR3_CFG3_Msk                       /*!< HW generic 3 */
#define MCE_HWCFGR3_CFG4_Pos        (12U)
#define MCE_HWCFGR3_CFG4_Msk        (0xFUL << MCE_HWCFGR3_CFG4_Pos)             /*!< 0x0000F000 */
#define MCE_HWCFGR3_CFG4            MCE_HWCFGR3_CFG4_Msk                       /*!< HW generic 4 */
#define MCE_HWCFGR3_CFG5_Pos        (16U)
#define MCE_HWCFGR3_CFG5_Msk        (0xFUL << MCE_HWCFGR3_CFG5_Pos)             /*!< 0x000F0000 */
#define MCE_HWCFGR3_CFG5            MCE_HWCFGR3_CFG5_Msk                       /*!< HW generic 5 */
#define MCE_HWCFGR3_CFG6_Pos        (20U)
#define MCE_HWCFGR3_CFG6_Msk        (0xFUL << MCE_HWCFGR3_CFG6_Pos)             /*!< 0x00F00000 */
#define MCE_HWCFGR3_CFG6            MCE_HWCFGR3_CFG6_Msk                       /*!< HW generic 6 */
#define MCE_HWCFGR3_CFG7_Pos        (24U)
#define MCE_HWCFGR3_CFG7_Msk        (0xFUL << MCE_HWCFGR3_CFG7_Pos)             /*!< 0x0F000000 */
#define MCE_HWCFGR3_CFG7            MCE_HWCFGR3_CFG7_Msk                       /*!< HW generic 7 */
#define MCE_HWCFGR3_CFG8_Pos        (28U)
#define MCE_HWCFGR3_CFG8_Msk        (0xFUL << MCE_HWCFGR3_CFG8_Pos)             /*!< 0xF0000000 */
#define MCE_HWCFGR3_CFG8            MCE_HWCFGR3_CFG8_Msk                       /*!< HW generic 8 */

/********************  Bit definition for MCE_HWCFGR2 register  ***************/

#define MCE_HWCFGR2_CFG1_Pos        (0U)
#define MCE_HWCFGR2_CFG1_Msk        (0xFUL << MCE_HWCFGR2_CFG1_Pos)             /*!< 0x0000000F */
#define MCE_HWCFGR2_CFG1            MCE_HWCFGR2_CFG1_Msk                       /*!< HW generic 1 */
#define MCE_HWCFGR2_CFG2_Pos        (4U)
#define MCE_HWCFGR2_CFG2_Msk        (0xFUL << MCE_HWCFGR2_CFG2_Pos)             /*!< 0x000000F0 */
#define MCE_HWCFGR2_CFG2            MCE_HWCFGR2_CFG2_Msk                       /*!< HW generic 2 */
#define MCE_HWCFGR2_CFG3_Pos        (8U)
#define MCE_HWCFGR2_CFG3_Msk        (0xFUL << MCE_HWCFGR2_CFG3_Pos)             /*!< 0x00000F00 */
#define MCE_HWCFGR2_CFG3            MCE_HWCFGR2_CFG3_Msk                       /*!< HW generic 3 */
#define MCE_HWCFGR2_CFG4_Pos        (12U)
#define MCE_HWCFGR2_CFG4_Msk        (0xFUL << MCE_HWCFGR2_CFG4_Pos)             /*!< 0x0000F000 */
#define MCE_HWCFGR2_CFG4            MCE_HWCFGR2_CFG4_Msk                       /*!< HW generic 4 */
#define MCE_HWCFGR2_CFG5_Pos        (16U)
#define MCE_HWCFGR2_CFG5_Msk        (0xFUL << MCE_HWCFGR2_CFG5_Pos)             /*!< 0x000F0000 */
#define MCE_HWCFGR2_CFG5            MCE_HWCFGR2_CFG5_Msk                       /*!< HW generic 5 */
#define MCE_HWCFGR2_CFG6_Pos        (20U)
#define MCE_HWCFGR2_CFG6_Msk        (0xFUL << MCE_HWCFGR2_CFG6_Pos)             /*!< 0x00F00000 */
#define MCE_HWCFGR2_CFG6            MCE_HWCFGR2_CFG6_Msk                       /*!< HW generic 6 */
#define MCE_HWCFGR2_CFG7_Pos        (24U)
#define MCE_HWCFGR2_CFG7_Msk        (0xFUL << MCE_HWCFGR2_CFG7_Pos)             /*!< 0x0F000000 */
#define MCE_HWCFGR2_CFG7            MCE_HWCFGR2_CFG7_Msk                       /*!< HW generic 7 */
#define MCE_HWCFGR2_CFG8_Pos        (28U)
#define MCE_HWCFGR2_CFG8_Msk        (0xFUL << MCE_HWCFGR2_CFG8_Pos)             /*!< 0xF0000000 */
#define MCE_HWCFGR2_CFG8            MCE_HWCFGR2_CFG8_Msk                       /*!< HW generic 8 */

/********************  Bit definition for MCE_HWCFGR1 register  ***************/

