zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135fxx_ca7.h
/**************  Bit definition for RCC_MP_APB6ENCLRR register  ***************/
#define RCC_MP_APB6ENCLRR_USART1EN_Pos             (0U)
#define RCC_MP_APB6ENCLRR_USART1EN_Msk             (0x1UL << RCC_MP_APB6ENCLRR_USART1EN_Pos)            /*!< 0x00000001 */
#define RCC_MP_APB6ENCLRR_USART1EN                 RCC_MP_APB6ENCLRR_USART1EN_Msk                      /*!< USART1 peripherals clocks If USART1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_USART2EN_Pos             (1U)
#define RCC_MP_APB6ENCLRR_USART2EN_Msk             (0x1UL << RCC_MP_APB6ENCLRR_USART2EN_Pos)            /*!< 0x00000002 */
#define RCC_MP_APB6ENCLRR_USART2EN                 RCC_MP_APB6ENCLRR_USART2EN_Msk                      /*!< USART2 peripherals clocks If USART2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_SPI4EN_Pos               (2U)
#define RCC_MP_APB6ENCLRR_SPI4EN_Msk               (0x1UL << RCC_MP_APB6ENCLRR_SPI4EN_Pos)              /*!< 0x00000004 */
#define RCC_MP_APB6ENCLRR_SPI4EN                   RCC_MP_APB6ENCLRR_SPI4EN_Msk                        /*!< SPI4 peripherals clocks If SPI4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_SPI5EN_Pos               (3U)
#define RCC_MP_APB6ENCLRR_SPI5EN_Msk               (0x1UL << RCC_MP_APB6ENCLRR_SPI5EN_Pos)              /*!< 0x00000008 */
#define RCC_MP_APB6ENCLRR_SPI5EN                   RCC_MP_APB6ENCLRR_SPI5EN_Msk                        /*!< SPI5 peripherals clocks If SPI5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_I2C3EN_Pos               (4U)
#define RCC_MP_APB6ENCLRR_I2C3EN_Msk               (0x1UL << RCC_MP_APB6ENCLRR_I2C3EN_Pos)              /*!< 0x00000010 */
#define RCC_MP_APB6ENCLRR_I2C3EN                   RCC_MP_APB6ENCLRR_I2C3EN_Msk                        /*!< I2C3 peripherals clocks If I2C3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_I2C4EN_Pos               (5U)
#define RCC_MP_APB6ENCLRR_I2C4EN_Msk               (0x1UL << RCC_MP_APB6ENCLRR_I2C4EN_Pos)              /*!< 0x00000020 */
#define RCC_MP_APB6ENCLRR_I2C4EN                   RCC_MP_APB6ENCLRR_I2C4EN_Msk                        /*!< I2C4 peripherals clocks If I2C4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_I2C5EN_Pos               (6U)
#define RCC_MP_APB6ENCLRR_I2C5EN_Msk               (0x1UL << RCC_MP_APB6ENCLRR_I2C5EN_Pos)              /*!< 0x00000040 */
#define RCC_MP_APB6ENCLRR_I2C5EN                   RCC_MP_APB6ENCLRR_I2C5EN_Msk                        /*!< I2C5 peripherals clocks If I2C5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_TIM12EN_Pos              (7U)
#define RCC_MP_APB6ENCLRR_TIM12EN_Msk              (0x1UL << RCC_MP_APB6ENCLRR_TIM12EN_Pos)             /*!< 0x00000080 */
#define RCC_MP_APB6ENCLRR_TIM12EN                  RCC_MP_APB6ENCLRR_TIM12EN_Msk                       /*!< TIM12 peripherals clocks If TIM12 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_TIM13EN_Pos              (8U)
#define RCC_MP_APB6ENCLRR_TIM13EN_Msk              (0x1UL << RCC_MP_APB6ENCLRR_TIM13EN_Pos)             /*!< 0x00000100 */
#define RCC_MP_APB6ENCLRR_TIM13EN                  RCC_MP_APB6ENCLRR_TIM13EN_Msk                       /*!< TIM13 peripherals clocks If TIM13 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_TIM14EN_Pos              (9U)
#define RCC_MP_APB6ENCLRR_TIM14EN_Msk              (0x1UL << RCC_MP_APB6ENCLRR_TIM14EN_Pos)             /*!< 0x00000200 */
#define RCC_MP_APB6ENCLRR_TIM14EN                  RCC_MP_APB6ENCLRR_TIM14EN_Msk                       /*!< TIM14 peripherals clocks If TIM14 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_TIM15EN_Pos              (10U)
#define RCC_MP_APB6ENCLRR_TIM15EN_Msk              (0x1UL << RCC_MP_APB6ENCLRR_TIM15EN_Pos)             /*!< 0x00000400 */
#define RCC_MP_APB6ENCLRR_TIM15EN                  RCC_MP_APB6ENCLRR_TIM15EN_Msk                       /*!< TIM15 peripherals clocks If TIM15 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_TIM16EN_Pos              (11U)
#define RCC_MP_APB6ENCLRR_TIM16EN_Msk              (0x1UL << RCC_MP_APB6ENCLRR_TIM16EN_Pos)             /*!< 0x00000800 */
#define RCC_MP_APB6ENCLRR_TIM16EN                  RCC_MP_APB6ENCLRR_TIM16EN_Msk                       /*!< TIM16 peripherals clocks If TIM16 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6ENCLRR_TIM17EN_Pos              (12U)
#define RCC_MP_APB6ENCLRR_TIM17EN_Msk              (0x1UL << RCC_MP_APB6ENCLRR_TIM17EN_Pos)             /*!< 0x00001000 */
#define RCC_MP_APB6ENCLRR_TIM17EN                  RCC_MP_APB6ENCLRR_TIM17EN_Msk                       /*!< TIM17 peripherals clocks If TIM17 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/**************  Bit definition for RCC_MP_AHB2ENSETR register  ***************/
#define RCC_MP_AHB2ENSETR_DMA1EN_Pos               (0U)
#define RCC_MP_AHB2ENSETR_DMA1EN_Msk               (0x1UL << RCC_MP_AHB2ENSETR_DMA1EN_Pos)              /*!< 0x00000001 */
#define RCC_MP_AHB2ENSETR_DMA1EN                   RCC_MP_AHB2ENSETR_DMA1EN_Msk                        /*!< DMA1 peripheral clocks enable Set by software. */
#define RCC_MP_AHB2ENSETR_DMA2EN_Pos               (1U)
#define RCC_MP_AHB2ENSETR_DMA2EN_Msk               (0x1UL << RCC_MP_AHB2ENSETR_DMA2EN_Pos)              /*!< 0x00000002 */
#define RCC_MP_AHB2ENSETR_DMA2EN                   RCC_MP_AHB2ENSETR_DMA2EN_Msk                        /*!< DMA2 peripheral clocks enable Set by software. */
#define RCC_MP_AHB2ENSETR_DMAMUX1EN_Pos            (2U)
#define RCC_MP_AHB2ENSETR_DMAMUX1EN_Msk            (0x1UL << RCC_MP_AHB2ENSETR_DMAMUX1EN_Pos)           /*!< 0x00000004 */
#define RCC_MP_AHB2ENSETR_DMAMUX1EN                RCC_MP_AHB2ENSETR_DMAMUX1EN_Msk                     /*!< DMAMUX1 peripheral clocks enable Set by software. */
#define RCC_MP_AHB2ENSETR_DMA3EN_Pos               (3U)
#define RCC_MP_AHB2ENSETR_DMA3EN_Msk               (0x1UL << RCC_MP_AHB2ENSETR_DMA3EN_Pos)              /*!< 0x00000008 */
#define RCC_MP_AHB2ENSETR_DMA3EN                   RCC_MP_AHB2ENSETR_DMA3EN_Msk                        /*!< DMA3 peripheral clocks enable If DMA3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB2ENSETR_DMAMUX2EN_Pos            (4U)
#define RCC_MP_AHB2ENSETR_DMAMUX2EN_Msk            (0x1UL << RCC_MP_AHB2ENSETR_DMAMUX2EN_Pos)           /*!< 0x00000010 */
#define RCC_MP_AHB2ENSETR_DMAMUX2EN                RCC_MP_AHB2ENSETR_DMAMUX2EN_Msk                     /*!< DMAMUX2 peripheral clocks enable If DMAMUX2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB2ENSETR_ADC1EN_Pos               (5U)
#define RCC_MP_AHB2ENSETR_ADC1EN_Msk               (0x1UL << RCC_MP_AHB2ENSETR_ADC1EN_Pos)              /*!< 0x00000020 */
#define RCC_MP_AHB2ENSETR_ADC1EN                   RCC_MP_AHB2ENSETR_ADC1EN_Msk                        /*!< ADC1 peripheral clocks enable If ADC1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB2ENSETR_ADC2EN_Pos               (6U)
#define RCC_MP_AHB2ENSETR_ADC2EN_Msk               (0x1UL << RCC_MP_AHB2ENSETR_ADC2EN_Pos)              /*!< 0x00000040 */
#define RCC_MP_AHB2ENSETR_ADC2EN                   RCC_MP_AHB2ENSETR_ADC2EN_Msk                        /*!< ADC2 peripheral clocks enable If ADC2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB2ENSETR_USBOEN_Pos               (8U)
#define RCC_MP_AHB2ENSETR_USBOEN_Msk               (0x1UL << RCC_MP_AHB2ENSETR_USBOEN_Pos)              /*!< 0x00000100 */
#define RCC_MP_AHB2ENSETR_USBOEN                   RCC_MP_AHB2ENSETR_USBOEN_Msk                        /*!< USBO peripheral clocks enable If USBO is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/**************  Bit definition for RCC_MP_AHB2ENCLRR register  ***************/
#define RCC_MP_AHB2ENCLRR_DMA1EN_Pos               (0U)
#define RCC_MP_AHB2ENCLRR_DMA1EN_Msk               (0x1UL << RCC_MP_AHB2ENCLRR_DMA1EN_Pos)              /*!< 0x00000001 */
#define RCC_MP_AHB2ENCLRR_DMA1EN                   RCC_MP_AHB2ENCLRR_DMA1EN_Msk                        /*!< DMA1 peripheral clocks enable Cleared by software. */
#define RCC_MP_AHB2ENCLRR_DMA2EN_Pos               (1U)
#define RCC_MP_AHB2ENCLRR_DMA2EN_Msk               (0x1UL << RCC_MP_AHB2ENCLRR_DMA2EN_Pos)              /*!< 0x00000002 */
#define RCC_MP_AHB2ENCLRR_DMA2EN                   RCC_MP_AHB2ENCLRR_DMA2EN_Msk                        /*!< DMA2 peripheral clocks enable Cleared by software. */
#define RCC_MP_AHB2ENCLRR_DMAMUX1EN_Pos            (2U)
#define RCC_MP_AHB2ENCLRR_DMAMUX1EN_Msk            (0x1UL << RCC_MP_AHB2ENCLRR_DMAMUX1EN_Pos)           /*!< 0x00000004 */
#define RCC_MP_AHB2ENCLRR_DMAMUX1EN                RCC_MP_AHB2ENCLRR_DMAMUX1EN_Msk                     /*!< DMAMUX1 peripheral clocks enable Cleared by software. */
#define RCC_MP_AHB2ENCLRR_DMA3EN_Pos               (3U)
#define RCC_MP_AHB2ENCLRR_DMA3EN_Msk               (0x1UL << RCC_MP_AHB2ENCLRR_DMA3EN_Pos)              /*!< 0x00000008 */
#define RCC_MP_AHB2ENCLRR_DMA3EN                   RCC_MP_AHB2ENCLRR_DMA3EN_Msk                        /*!< DMA3 peripheral clocks enable If DMA3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB2ENCLRR_DMAMUX2EN_Pos            (4U)
#define RCC_MP_AHB2ENCLRR_DMAMUX2EN_Msk            (0x1UL << RCC_MP_AHB2ENCLRR_DMAMUX2EN_Pos)           /*!< 0x00000010 */
#define RCC_MP_AHB2ENCLRR_DMAMUX2EN                RCC_MP_AHB2ENCLRR_DMAMUX2EN_Msk                     /*!< DMAMUX2 peripheral clocks enable If DMAMUX2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB2ENCLRR_ADC1EN_Pos               (5U)
#define RCC_MP_AHB2ENCLRR_ADC1EN_Msk               (0x1UL << RCC_MP_AHB2ENCLRR_ADC1EN_Pos)              /*!< 0x00000020 */
#define RCC_MP_AHB2ENCLRR_ADC1EN                   RCC_MP_AHB2ENCLRR_ADC1EN_Msk                        /*!< ADC1 peripheral clocks enable If ADC1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB2ENCLRR_ADC2EN_Pos               (6U)
#define RCC_MP_AHB2ENCLRR_ADC2EN_Msk               (0x1UL << RCC_MP_AHB2ENCLRR_ADC2EN_Pos)              /*!< 0x00000040 */
#define RCC_MP_AHB2ENCLRR_ADC2EN                   RCC_MP_AHB2ENCLRR_ADC2EN_Msk                        /*!< ADC2 peripheral clocks enable If ADC2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB2ENCLRR_USBOEN_Pos               (8U)
#define RCC_MP_AHB2ENCLRR_USBOEN_Msk               (0x1UL << RCC_MP_AHB2ENCLRR_USBOEN_Pos)              /*!< 0x00000100 */
#define RCC_MP_AHB2ENCLRR_USBOEN                   RCC_MP_AHB2ENCLRR_USBOEN_Msk                        /*!< USBO peripheral clocks enable If USBO is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */

/*************  Bit definition for RCC_MP_S_AHB4ENSETR register  **************/
#define RCC_MP_S_AHB4ENSETR_GPIOAEN_Pos            (0U)
#define RCC_MP_S_AHB4ENSETR_GPIOAEN_Msk            (0x1UL << RCC_MP_S_AHB4ENSETR_GPIOAEN_Pos)           /*!< 0x00000001 */
#define RCC_MP_S_AHB4ENSETR_GPIOAEN                RCC_MP_S_AHB4ENSETR_GPIOAEN_Msk                     /*!< GPIOA peripheral clocks enable Set by (secure) software. */
#define RCC_MP_S_AHB4ENSETR_GPIOBEN_Pos            (1U)
#define RCC_MP_S_AHB4ENSETR_GPIOBEN_Msk            (0x1UL << RCC_MP_S_AHB4ENSETR_GPIOBEN_Pos)           /*!< 0x00000002 */
#define RCC_MP_S_AHB4ENSETR_GPIOBEN                RCC_MP_S_AHB4ENSETR_GPIOBEN_Msk                     /*!< GPIOB peripheral clocks enable Set by (secure) software. */
#define RCC_MP_S_AHB4ENSETR_GPIOCEN_Pos            (2U)
#define RCC_MP_S_AHB4ENSETR_GPIOCEN_Msk            (0x1UL << RCC_MP_S_AHB4ENSETR_GPIOCEN_Pos)           /*!< 0x00000004 */
#define RCC_MP_S_AHB4ENSETR_GPIOCEN                RCC_MP_S_AHB4ENSETR_GPIOCEN_Msk                     /*!< GPIOC peripheral clocks enable Set by (secure) software. */
#define RCC_MP_S_AHB4ENSETR_GPIODEN_Pos            (3U)
#define RCC_MP_S_AHB4ENSETR_GPIODEN_Msk            (0x1UL << RCC_MP_S_AHB4ENSETR_GPIODEN_Pos)           /*!< 0x00000008 */
#define RCC_MP_S_AHB4ENSETR_GPIODEN                RCC_MP_S_AHB4ENSETR_GPIODEN_Msk                     /*!< GPIOD peripheral clocks enable Set by (secure) software. */
#define RCC_MP_S_AHB4ENSETR_GPIOEEN_Pos            (4U)
#define RCC_MP_S_AHB4ENSETR_GPIOEEN_Msk            (0x1UL << RCC_MP_S_AHB4ENSETR_GPIOEEN_Pos)           /*!< 0x00000010 */
#define RCC_MP_S_AHB4ENSETR_GPIOEEN                RCC_MP_S_AHB4ENSETR_GPIOEEN_Msk                     /*!< GPIOE peripheral clocks enable Set by (secure) software. */
#define RCC_MP_S_AHB4ENSETR_GPIOFEN_Pos            (5U)
#define RCC_MP_S_AHB4ENSETR_GPIOFEN_Msk            (0x1UL << RCC_MP_S_AHB4ENSETR_GPIOFEN_Pos)           /*!< 0x00000020 */
#define RCC_MP_S_AHB4ENSETR_GPIOFEN                RCC_MP_S_AHB4ENSETR_GPIOFEN_Msk                     /*!< GPIOF peripheral clocks enable Set by (secure) software. */
#define RCC_MP_S_AHB4ENSETR_GPIOGEN_Pos            (6U)
#define RCC_MP_S_AHB4ENSETR_GPIOGEN_Msk            (0x1UL << RCC_MP_S_AHB4ENSETR_GPIOGEN_Pos)           /*!< 0x00000040 */
#define RCC_MP_S_AHB4ENSETR_GPIOGEN                RCC_MP_S_AHB4ENSETR_GPIOGEN_Msk                     /*!< GPIOG peripheral clocks enable Set by (secure) software. */
#define RCC_MP_S_AHB4ENSETR_GPIOHEN_Pos            (7U)
#define RCC_MP_S_AHB4ENSETR_GPIOHEN_Msk            (0x1UL << RCC_MP_S_AHB4ENSETR_GPIOHEN_Pos)           /*!< 0x00000080 */
#define RCC_MP_S_AHB4ENSETR_GPIOHEN                RCC_MP_S_AHB4ENSETR_GPIOHEN_Msk                     /*!< GPIOH peripheral clocks enable Set by (secure) software. */
#define RCC_MP_S_AHB4ENSETR_GPIOIEN_Pos            (8U)
#define RCC_MP_S_AHB4ENSETR_GPIOIEN_Msk            (0x1UL << RCC_MP_S_AHB4ENSETR_GPIOIEN_Pos)           /*!< 0x00000100 */
#define RCC_MP_S_AHB4ENSETR_GPIOIEN                RCC_MP_S_AHB4ENSETR_GPIOIEN_Msk                     /*!< GPIOI peripheral clocks enable Set by (secure) software. */

