zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135fxx_ca7.h
/*************  Bit definition for RCC_MP_APB1LPENCLRR register  **************/
#define RCC_MP_APB1LPENCLRR_TIM2LPEN_Pos           (0U)
#define RCC_MP_APB1LPENCLRR_TIM2LPEN_Msk           (0x1UL << RCC_MP_APB1LPENCLRR_TIM2LPEN_Pos)          /*!< 0x00000001 */
#define RCC_MP_APB1LPENCLRR_TIM2LPEN               RCC_MP_APB1LPENCLRR_TIM2LPEN_Msk                    /*!< TIM2 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_TIM3LPEN_Pos           (1U)
#define RCC_MP_APB1LPENCLRR_TIM3LPEN_Msk           (0x1UL << RCC_MP_APB1LPENCLRR_TIM3LPEN_Pos)          /*!< 0x00000002 */
#define RCC_MP_APB1LPENCLRR_TIM3LPEN               RCC_MP_APB1LPENCLRR_TIM3LPEN_Msk                    /*!< TIM3 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_TIM4LPEN_Pos           (2U)
#define RCC_MP_APB1LPENCLRR_TIM4LPEN_Msk           (0x1UL << RCC_MP_APB1LPENCLRR_TIM4LPEN_Pos)          /*!< 0x00000004 */
#define RCC_MP_APB1LPENCLRR_TIM4LPEN               RCC_MP_APB1LPENCLRR_TIM4LPEN_Msk                    /*!< TIM4 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_TIM5LPEN_Pos           (3U)
#define RCC_MP_APB1LPENCLRR_TIM5LPEN_Msk           (0x1UL << RCC_MP_APB1LPENCLRR_TIM5LPEN_Pos)          /*!< 0x00000008 */
#define RCC_MP_APB1LPENCLRR_TIM5LPEN               RCC_MP_APB1LPENCLRR_TIM5LPEN_Msk                    /*!< TIM5 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_TIM6LPEN_Pos           (4U)
#define RCC_MP_APB1LPENCLRR_TIM6LPEN_Msk           (0x1UL << RCC_MP_APB1LPENCLRR_TIM6LPEN_Pos)          /*!< 0x00000010 */
#define RCC_MP_APB1LPENCLRR_TIM6LPEN               RCC_MP_APB1LPENCLRR_TIM6LPEN_Msk                    /*!< TIM6 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_TIM7LPEN_Pos           (5U)
#define RCC_MP_APB1LPENCLRR_TIM7LPEN_Msk           (0x1UL << RCC_MP_APB1LPENCLRR_TIM7LPEN_Pos)          /*!< 0x00000020 */
#define RCC_MP_APB1LPENCLRR_TIM7LPEN               RCC_MP_APB1LPENCLRR_TIM7LPEN_Msk                    /*!< TIM7 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_LPTIM1LPEN_Pos         (9U)
#define RCC_MP_APB1LPENCLRR_LPTIM1LPEN_Msk         (0x1UL << RCC_MP_APB1LPENCLRR_LPTIM1LPEN_Pos)        /*!< 0x00000200 */
#define RCC_MP_APB1LPENCLRR_LPTIM1LPEN             RCC_MP_APB1LPENCLRR_LPTIM1LPEN_Msk                  /*!< LPTIM1 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_SPI2LPEN_Pos           (11U)
#define RCC_MP_APB1LPENCLRR_SPI2LPEN_Msk           (0x1UL << RCC_MP_APB1LPENCLRR_SPI2LPEN_Pos)          /*!< 0x00000800 */
#define RCC_MP_APB1LPENCLRR_SPI2LPEN               RCC_MP_APB1LPENCLRR_SPI2LPEN_Msk                    /*!< SPI2 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_SPI3LPEN_Pos           (12U)
#define RCC_MP_APB1LPENCLRR_SPI3LPEN_Msk           (0x1UL << RCC_MP_APB1LPENCLRR_SPI3LPEN_Pos)          /*!< 0x00001000 */
#define RCC_MP_APB1LPENCLRR_SPI3LPEN               RCC_MP_APB1LPENCLRR_SPI3LPEN_Msk                    /*!< SPI3 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_USART3LPEN_Pos         (15U)
#define RCC_MP_APB1LPENCLRR_USART3LPEN_Msk         (0x1UL << RCC_MP_APB1LPENCLRR_USART3LPEN_Pos)        /*!< 0x00008000 */
#define RCC_MP_APB1LPENCLRR_USART3LPEN             RCC_MP_APB1LPENCLRR_USART3LPEN_Msk                  /*!< USART3 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_UART4LPEN_Pos          (16U)
#define RCC_MP_APB1LPENCLRR_UART4LPEN_Msk          (0x1UL << RCC_MP_APB1LPENCLRR_UART4LPEN_Pos)         /*!< 0x00010000 */
#define RCC_MP_APB1LPENCLRR_UART4LPEN              RCC_MP_APB1LPENCLRR_UART4LPEN_Msk                   /*!< UART4 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_UART5LPEN_Pos          (17U)
#define RCC_MP_APB1LPENCLRR_UART5LPEN_Msk          (0x1UL << RCC_MP_APB1LPENCLRR_UART5LPEN_Pos)         /*!< 0x00020000 */
#define RCC_MP_APB1LPENCLRR_UART5LPEN              RCC_MP_APB1LPENCLRR_UART5LPEN_Msk                   /*!< UART5 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_UART7LPEN_Pos          (18U)
#define RCC_MP_APB1LPENCLRR_UART7LPEN_Msk          (0x1UL << RCC_MP_APB1LPENCLRR_UART7LPEN_Pos)         /*!< 0x00040000 */
#define RCC_MP_APB1LPENCLRR_UART7LPEN              RCC_MP_APB1LPENCLRR_UART7LPEN_Msk                   /*!< UART7 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_UART8LPEN_Pos          (19U)
#define RCC_MP_APB1LPENCLRR_UART8LPEN_Msk          (0x1UL << RCC_MP_APB1LPENCLRR_UART8LPEN_Pos)         /*!< 0x00080000 */
#define RCC_MP_APB1LPENCLRR_UART8LPEN              RCC_MP_APB1LPENCLRR_UART8LPEN_Msk                   /*!< UART8 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_I2C1LPEN_Pos           (21U)
#define RCC_MP_APB1LPENCLRR_I2C1LPEN_Msk           (0x1UL << RCC_MP_APB1LPENCLRR_I2C1LPEN_Pos)          /*!< 0x00200000 */
#define RCC_MP_APB1LPENCLRR_I2C1LPEN               RCC_MP_APB1LPENCLRR_I2C1LPEN_Msk                    /*!< I2C1 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_I2C2LPEN_Pos           (22U)
#define RCC_MP_APB1LPENCLRR_I2C2LPEN_Msk           (0x1UL << RCC_MP_APB1LPENCLRR_I2C2LPEN_Pos)          /*!< 0x00400000 */
#define RCC_MP_APB1LPENCLRR_I2C2LPEN               RCC_MP_APB1LPENCLRR_I2C2LPEN_Msk                    /*!< I2C2 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB1LPENCLRR_SPDIFLPEN_Pos          (26U)
#define RCC_MP_APB1LPENCLRR_SPDIFLPEN_Msk          (0x1UL << RCC_MP_APB1LPENCLRR_SPDIFLPEN_Pos)         /*!< 0x04000000 */
#define RCC_MP_APB1LPENCLRR_SPDIFLPEN              RCC_MP_APB1LPENCLRR_SPDIFLPEN_Msk                   /*!< SPDIFRX peripheral clocks enable during CSleep mode Cleared by software. */

/*************  Bit definition for RCC_MP_APB2LPENSETR register  **************/
#define RCC_MP_APB2LPENSETR_TIM1LPEN_Pos           (0U)
#define RCC_MP_APB2LPENSETR_TIM1LPEN_Msk           (0x1UL << RCC_MP_APB2LPENSETR_TIM1LPEN_Pos)          /*!< 0x00000001 */
#define RCC_MP_APB2LPENSETR_TIM1LPEN               RCC_MP_APB2LPENSETR_TIM1LPEN_Msk                    /*!< TIM1 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB2LPENSETR_TIM8LPEN_Pos           (1U)
#define RCC_MP_APB2LPENSETR_TIM8LPEN_Msk           (0x1UL << RCC_MP_APB2LPENSETR_TIM8LPEN_Pos)          /*!< 0x00000002 */
#define RCC_MP_APB2LPENSETR_TIM8LPEN               RCC_MP_APB2LPENSETR_TIM8LPEN_Msk                    /*!< TIM8 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB2LPENSETR_SPI1LPEN_Pos           (8U)
#define RCC_MP_APB2LPENSETR_SPI1LPEN_Msk           (0x1UL << RCC_MP_APB2LPENSETR_SPI1LPEN_Pos)          /*!< 0x00000100 */
#define RCC_MP_APB2LPENSETR_SPI1LPEN               RCC_MP_APB2LPENSETR_SPI1LPEN_Msk                    /*!< SPI/I2S1 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB2LPENSETR_USART6LPEN_Pos         (13U)
#define RCC_MP_APB2LPENSETR_USART6LPEN_Msk         (0x1UL << RCC_MP_APB2LPENSETR_USART6LPEN_Pos)        /*!< 0x00002000 */
#define RCC_MP_APB2LPENSETR_USART6LPEN             RCC_MP_APB2LPENSETR_USART6LPEN_Msk                  /*!< USART6 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB2LPENSETR_SAI1LPEN_Pos           (16U)
#define RCC_MP_APB2LPENSETR_SAI1LPEN_Msk           (0x1UL << RCC_MP_APB2LPENSETR_SAI1LPEN_Pos)          /*!< 0x00010000 */
#define RCC_MP_APB2LPENSETR_SAI1LPEN               RCC_MP_APB2LPENSETR_SAI1LPEN_Msk                    /*!< SAI1 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB2LPENSETR_SAI2LPEN_Pos           (17U)
#define RCC_MP_APB2LPENSETR_SAI2LPEN_Msk           (0x1UL << RCC_MP_APB2LPENSETR_SAI2LPEN_Pos)          /*!< 0x00020000 */
#define RCC_MP_APB2LPENSETR_SAI2LPEN               RCC_MP_APB2LPENSETR_SAI2LPEN_Msk                    /*!< SAI2 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB2LPENSETR_DFSDMLPEN_Pos          (20U)
#define RCC_MP_APB2LPENSETR_DFSDMLPEN_Msk          (0x1UL << RCC_MP_APB2LPENSETR_DFSDMLPEN_Pos)         /*!< 0x00100000 */
#define RCC_MP_APB2LPENSETR_DFSDMLPEN              RCC_MP_APB2LPENSETR_DFSDMLPEN_Msk                   /*!< DFSDM peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB2LPENSETR_ADFSDMLPEN_Pos         (21U)
#define RCC_MP_APB2LPENSETR_ADFSDMLPEN_Msk         (0x1UL << RCC_MP_APB2LPENSETR_ADFSDMLPEN_Pos)        /*!< 0x00200000 */
#define RCC_MP_APB2LPENSETR_ADFSDMLPEN             RCC_MP_APB2LPENSETR_ADFSDMLPEN_Msk                  /*!< Audio DFSDM peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB2LPENSETR_FDCANLPEN_Pos          (24U)
#define RCC_MP_APB2LPENSETR_FDCANLPEN_Msk          (0x1UL << RCC_MP_APB2LPENSETR_FDCANLPEN_Pos)         /*!< 0x01000000 */
#define RCC_MP_APB2LPENSETR_FDCANLPEN              RCC_MP_APB2LPENSETR_FDCANLPEN_Msk                   /*!< FDCAN and CANRAM peripheral clocks enable during CSleep mode Set by software. */

/*************  Bit definition for RCC_MP_APB2LPENCLRR register  **************/
#define RCC_MP_APB2LPENCLRR_TIM1LPEN_Pos           (0U)
#define RCC_MP_APB2LPENCLRR_TIM1LPEN_Msk           (0x1UL << RCC_MP_APB2LPENCLRR_TIM1LPEN_Pos)          /*!< 0x00000001 */
#define RCC_MP_APB2LPENCLRR_TIM1LPEN               RCC_MP_APB2LPENCLRR_TIM1LPEN_Msk                    /*!< TIM1 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB2LPENCLRR_TIM8LPEN_Pos           (1U)
#define RCC_MP_APB2LPENCLRR_TIM8LPEN_Msk           (0x1UL << RCC_MP_APB2LPENCLRR_TIM8LPEN_Pos)          /*!< 0x00000002 */
#define RCC_MP_APB2LPENCLRR_TIM8LPEN               RCC_MP_APB2LPENCLRR_TIM8LPEN_Msk                    /*!< TIM8 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB2LPENCLRR_SPI1LPEN_Pos           (8U)
#define RCC_MP_APB2LPENCLRR_SPI1LPEN_Msk           (0x1UL << RCC_MP_APB2LPENCLRR_SPI1LPEN_Pos)          /*!< 0x00000100 */
#define RCC_MP_APB2LPENCLRR_SPI1LPEN               RCC_MP_APB2LPENCLRR_SPI1LPEN_Msk                    /*!< SPI/I2S1 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB2LPENCLRR_USART6LPEN_Pos         (13U)
#define RCC_MP_APB2LPENCLRR_USART6LPEN_Msk         (0x1UL << RCC_MP_APB2LPENCLRR_USART6LPEN_Pos)        /*!< 0x00002000 */
#define RCC_MP_APB2LPENCLRR_USART6LPEN             RCC_MP_APB2LPENCLRR_USART6LPEN_Msk                  /*!< USART6 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB2LPENCLRR_SAI1LPEN_Pos           (16U)
#define RCC_MP_APB2LPENCLRR_SAI1LPEN_Msk           (0x1UL << RCC_MP_APB2LPENCLRR_SAI1LPEN_Pos)          /*!< 0x00010000 */
#define RCC_MP_APB2LPENCLRR_SAI1LPEN               RCC_MP_APB2LPENCLRR_SAI1LPEN_Msk                    /*!< SAI1 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB2LPENCLRR_SAI2LPEN_Pos           (17U)
#define RCC_MP_APB2LPENCLRR_SAI2LPEN_Msk           (0x1UL << RCC_MP_APB2LPENCLRR_SAI2LPEN_Pos)          /*!< 0x00020000 */
#define RCC_MP_APB2LPENCLRR_SAI2LPEN               RCC_MP_APB2LPENCLRR_SAI2LPEN_Msk                    /*!< SAI2 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB2LPENCLRR_DFSDMLPEN_Pos          (20U)
#define RCC_MP_APB2LPENCLRR_DFSDMLPEN_Msk          (0x1UL << RCC_MP_APB2LPENCLRR_DFSDMLPEN_Pos)         /*!< 0x00100000 */
#define RCC_MP_APB2LPENCLRR_DFSDMLPEN              RCC_MP_APB2LPENCLRR_DFSDMLPEN_Msk                   /*!< DFSDM peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB2LPENCLRR_ADFSDMLPEN_Pos         (21U)
#define RCC_MP_APB2LPENCLRR_ADFSDMLPEN_Msk         (0x1UL << RCC_MP_APB2LPENCLRR_ADFSDMLPEN_Pos)        /*!< 0x00200000 */
#define RCC_MP_APB2LPENCLRR_ADFSDMLPEN             RCC_MP_APB2LPENCLRR_ADFSDMLPEN_Msk                  /*!< Audio DFSDM peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB2LPENCLRR_FDCANLPEN_Pos          (24U)
#define RCC_MP_APB2LPENCLRR_FDCANLPEN_Msk          (0x1UL << RCC_MP_APB2LPENCLRR_FDCANLPEN_Pos)         /*!< 0x01000000 */
#define RCC_MP_APB2LPENCLRR_FDCANLPEN              RCC_MP_APB2LPENCLRR_FDCANLPEN_Msk                   /*!< FDCAN and CANRAM peripheral clocks enable during CSleep mode Cleared by software. */

/*************  Bit definition for RCC_MP_APB3LPENSETR register  **************/
#define RCC_MP_APB3LPENSETR_LPTIM2LPEN_Pos         (0U)
#define RCC_MP_APB3LPENSETR_LPTIM2LPEN_Msk         (0x1UL << RCC_MP_APB3LPENSETR_LPTIM2LPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_APB3LPENSETR_LPTIM2LPEN             RCC_MP_APB3LPENSETR_LPTIM2LPEN_Msk                  /*!< LPTIM2 peripheral clocks enable during CSleep mode If LPTIM2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB3LPENSETR_LPTIM3LPEN_Pos         (1U)
#define RCC_MP_APB3LPENSETR_LPTIM3LPEN_Msk         (0x1UL << RCC_MP_APB3LPENSETR_LPTIM3LPEN_Pos)        /*!< 0x00000002 */
#define RCC_MP_APB3LPENSETR_LPTIM3LPEN             RCC_MP_APB3LPENSETR_LPTIM3LPEN_Msk                  /*!< LPTIM3 peripheral clocks enable during CSleep mode If LPTIM3 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB3LPENSETR_LPTIM4LPEN_Pos         (2U)
#define RCC_MP_APB3LPENSETR_LPTIM4LPEN_Msk         (0x1UL << RCC_MP_APB3LPENSETR_LPTIM4LPEN_Pos)        /*!< 0x00000004 */
#define RCC_MP_APB3LPENSETR_LPTIM4LPEN             RCC_MP_APB3LPENSETR_LPTIM4LPEN_Msk                  /*!< LPTIM4 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB3LPENSETR_LPTIM5LPEN_Pos         (3U)
#define RCC_MP_APB3LPENSETR_LPTIM5LPEN_Msk         (0x1UL << RCC_MP_APB3LPENSETR_LPTIM5LPEN_Pos)        /*!< 0x00000008 */
#define RCC_MP_APB3LPENSETR_LPTIM5LPEN             RCC_MP_APB3LPENSETR_LPTIM5LPEN_Msk                  /*!< LPTIM5 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB3LPENSETR_VREFLPEN_Pos           (13U)
#define RCC_MP_APB3LPENSETR_VREFLPEN_Msk           (0x1UL << RCC_MP_APB3LPENSETR_VREFLPEN_Pos)          /*!< 0x00002000 */
#define RCC_MP_APB3LPENSETR_VREFLPEN               RCC_MP_APB3LPENSETR_VREFLPEN_Msk                    /*!< VREF peripheral clocks enable during CSleep mode If VREF block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB3LPENSETR_DTSLPEN_Pos            (16U)
#define RCC_MP_APB3LPENSETR_DTSLPEN_Msk            (0x1UL << RCC_MP_APB3LPENSETR_DTSLPEN_Pos)           /*!< 0x00010000 */
#define RCC_MP_APB3LPENSETR_DTSLPEN                RCC_MP_APB3LPENSETR_DTSLPEN_Msk                     /*!< DTS peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB3LPENSETR_PMBCTRLLPEN_Pos        (17U)
#define RCC_MP_APB3LPENSETR_PMBCTRLLPEN_Msk        (0x1UL << RCC_MP_APB3LPENSETR_PMBCTRLLPEN_Pos)       /*!< 0x00020000 */
#define RCC_MP_APB3LPENSETR_PMBCTRLLPEN            RCC_MP_APB3LPENSETR_PMBCTRLLPEN_Msk                 /*!< PMBCTRL peripheral clocks enable during CSeep mode (non-user): this bit is present in the RTL and is internally used as: SPIRIT parameter RTLPRESENT */

/*************  Bit definition for RCC_MP_APB3LPENCLRR register  **************/
#define RCC_MP_APB3LPENCLRR_LPTIM2LPEN_Pos         (0U)
#define RCC_MP_APB3LPENCLRR_LPTIM2LPEN_Msk         (0x1UL << RCC_MP_APB3LPENCLRR_LPTIM2LPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_APB3LPENCLRR_LPTIM2LPEN             RCC_MP_APB3LPENCLRR_LPTIM2LPEN_Msk                  /*!< LPTIM2 peripheral clocks enable during CSleep mode If LPTIM2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB3LPENCLRR_LPTIM3LPEN_Pos         (1U)
#define RCC_MP_APB3LPENCLRR_LPTIM3LPEN_Msk         (0x1UL << RCC_MP_APB3LPENCLRR_LPTIM3LPEN_Pos)        /*!< 0x00000002 */
#define RCC_MP_APB3LPENCLRR_LPTIM3LPEN             RCC_MP_APB3LPENCLRR_LPTIM3LPEN_Msk                  /*!< LPTIM3 peripheral clocks enable during CSleep mode If LPTIM3 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB3LPENCLRR_LPTIM4LPEN_Pos         (2U)
#define RCC_MP_APB3LPENCLRR_LPTIM4LPEN_Msk         (0x1UL << RCC_MP_APB3LPENCLRR_LPTIM4LPEN_Pos)        /*!< 0x00000004 */
#define RCC_MP_APB3LPENCLRR_LPTIM4LPEN             RCC_MP_APB3LPENCLRR_LPTIM4LPEN_Msk                  /*!< LPTIM4 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB3LPENCLRR_LPTIM5LPEN_Pos         (3U)
#define RCC_MP_APB3LPENCLRR_LPTIM5LPEN_Msk         (0x1UL << RCC_MP_APB3LPENCLRR_LPTIM5LPEN_Pos)        /*!< 0x00000008 */
#define RCC_MP_APB3LPENCLRR_LPTIM5LPEN             RCC_MP_APB3LPENCLRR_LPTIM5LPEN_Msk                  /*!< LPTIM5 peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB3LPENCLRR_VREFLPEN_Pos           (13U)
#define RCC_MP_APB3LPENCLRR_VREFLPEN_Msk           (0x1UL << RCC_MP_APB3LPENCLRR_VREFLPEN_Pos)          /*!< 0x00002000 */
#define RCC_MP_APB3LPENCLRR_VREFLPEN               RCC_MP_APB3LPENCLRR_VREFLPEN_Msk                    /*!< VREF peripheral clocks enable during CSleep mode If VREF block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB3LPENCLRR_DTSLPEN_Pos            (16U)
#define RCC_MP_APB3LPENCLRR_DTSLPEN_Msk            (0x1UL << RCC_MP_APB3LPENCLRR_DTSLPEN_Pos)           /*!< 0x00010000 */
#define RCC_MP_APB3LPENCLRR_DTSLPEN                RCC_MP_APB3LPENCLRR_DTSLPEN_Msk                     /*!< DTS peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_APB3LPENCLRR_PMBCTRLLPEN_Pos        (17U)
#define RCC_MP_APB3LPENCLRR_PMBCTRLLPEN_Msk        (0x1UL << RCC_MP_APB3LPENCLRR_PMBCTRLLPEN_Pos)       /*!< 0x00020000 */
#define RCC_MP_APB3LPENCLRR_PMBCTRLLPEN            RCC_MP_APB3LPENCLRR_PMBCTRLLPEN_Msk                 /*!< PMBCTRL peripheral clocks enable during CSeep mode (non-user): this bit is present in the RTL and is internally used as: SPIRIT parameter RTLPRESENT */

